{
  "Mental Health ": [
    {
      "title": "Welcome to the MindSpa | Student Counseling Center  | TTU",
      "text": "To schedule call 806.742.3674 or schedule in person at 201 Student Wellness.  The MINDSPA provides Texas Tech enrolled students, faculty, and staff a space for\n                           deliberate and intentional relaxation and stress management. Equipped with many features\n                           and tools to help you relax your body and calm your mind. The MINDSPA provides a comfortable and private space for stress reducing activities,\n                           that isn’t always easy to find on a busy campus.  Stress is a physiological response to anything our bodies or minds perceive as a threat,\n                           and often that physiological response leads to tension in our muscles. Massage, stretching,\n                           and exercise can help relieve muscle tension caused by stress that we may not be aware\n                           of day-to-day.    New with the Fall 2022 Semester. Virtual reality offers immediate access to a whole\n                           world of experiences. The MINDSPA has VR hardware available for students to use as\n                           a part of their MINDSPA session. You can use VR to explore a tropical rain forest\n                           or beach halfway across the globe, immerse yourself in a meditation exercise, simulate\n                           relaxing activities like fishing or tai chi, let your mind focus on a 3D puzzle, or\n                           find ways new ways to express your creativity!  Virtual Reality headset and controllers must be requested from the front office when\n                           arriving for a MINDSPA appointment. The stress management audio-video library contains recordings for yoga nidra, breathing\n                           exercises, guided imagery, affirmations, and meditation. The library also includes\n                           relaxing music and sounds such as singing bowls, ocean waves, and rain.   The MINDSPA has plenty of space to roll out a yoga mat and practice moving meditation,\n                           gentle physical exercise, or somatic mind-body exercises. You can follow a video guide\n                           from one of our mind-body exercise DVDs, use the computer to find a guided exercise\n                           online, or practice independently.  The Zafu and Sabuton sets available are cushions that allow for comfortable sitting\n                           positions for sitting meditation and reflection.   Equipped with sensors that read bio-metric data such as respiration and heart rate,\n                           the MINDSPA offers software that coaches stress reduction strategies while seeing\n                           the real-time impact on your physiology.   Mindfulness exercises led by Student Counseling Center therapists are available in\n                           the audio-visual library, on our website, and by scanning the QR code located on the\n                           themed posters in the MINDSPA. Currently three exercises are available: Leaves on a Stream Loving Kindness Progressive Muscle Relaxation   Reviewed 5/1/23 \n\nContact Us\n\n\n\nIf you have any questions please call   806.742.3674. To initiate services, please come to our Walk-In Clinic hours.\n\n\n\n\nOFFICE HOURS\nMonday-Friday 8:00am-5:00pm\nWalk-In Clinic Hours \nMonday-Friday 12:30-3:30pm\nLOCATION\n\n\n\n  Second floor of the Student Wellness Center, Room 201   (on the corner of Flint Ave. & Main St.)\n GET DIRECTIONS \n\n\n \n\n\n  If you have any questions please call   806.742.3674. To initiate services, please come to our Walk-In Clinic hours. Monday-Friday 8:00am-5:00pm Monday-Friday 12:30-3:30pm   Second floor of the Student Wellness Center, Room 201   (on the corner of Flint Ave. & Main St.)   ",
      "url": "https://www.depts.ttu.edu/scc/self-help-resources/mindspa/"
    },
    {
      "title": "Student Health Services | Student Health Services  | TTU",
      "text": " Student Health Services  Measles Information \n\n\n \n \n\n\n\n\n\n\n   Submit your immunization records.   Start your new patient registration here.   Manage your care as a returning patient.   See what's happening at Student Health Services.    Monday - Thursday:8am - 5:30pm Phones are closed from 12:30pm - 1pm Friday:8am - 12pm   Monday - Thursday:8am - 5:30pm(Open during lunch hour)  Friday:8am - 12pm   If you need medical assistance after hours.       SERVICES PROVIDED BY  ",
      "url": "https://www.depts.ttu.edu/studenthealth/"
    },
    {
      "title": "Mentor Tech | Student Engagement | TTU",
      "text": " Student Engagement  Transitioning to college is exciting—but it can also be overwhelming. That’s where\n                              Mentor Tech comes in. Designed specifically for first-year students, Mentor Tech pairs\n                              you with a mentor to help you find your footing, build confidence, and thrive at Texas\n                              Tech. Through personalized, one-on-one mentorship with faculty, staff, upperclassmen, or\n                              alumni, you’ll gain practical tools, social support, and real-world advice for navigating\n                              life at Texas Tech—both in and out of the classroom. Mentor Tech empowers first-year Red Raiders by guiding them through the college transition\n                              and helping them grow in four key areas: Learn how to build community, make friends, navigate roommate relationships, and find\n                                    your place at Texas Tech. Discover study habits, tutoring resources, and strategies for success in and out of\n                                    the classroom. Build confidence, explore your identity, and develop healthy habits for self-care,\n                                    communication, and balance. Begin thinking ahead, learning professional skills, and connecting your college experience\n                                    to future goals. If you're a first-year undergrad at Texas Tech who's open to learning, growing, and\n                                    getting support—this program is for you! You don’t need to have it all figured out—just be: Growth takes time, and so does building trust. That’s totally normal—just come in\n                                    with patience, curiosity, and an open mind. Mentor Tech is a year-long experience that’s flexible—but still meaningful. Here’s\n                                    what you’ll need to do: You’ll also be invited to optional social and professional development meetup events\n                                    led by the Student Engagement Peer Mentor team.  Questions students often ask before joining Mentor Tech Joining Mentor Tech is easy—and it can make a big difference in your first year. Here’s how to get started: You don’t have to do college alone. Your mentor is here to help you feel supported, connected, and ready for what’s ahead. Mentor Tech mentors are faculty, staff, upper-level students, or alumni who care deeply\n                                    about supporting Red Raiders through their first year. You don’t have to be perfect or have all the answers. If you’ve ever faced a challenge,\n                                    figured out how to ask for help, or learned something the hard way—you’ve got what\n                                    it takes to be a mentor. Great mentors: Empathy, curiosity, and follow-through go a long way. Mentoring is meaningful—but not overwhelming. We keep it simple so you can focus on\n                                    the relationship, not the logistics. As a mentor, you’ll: *Faculty/Staff Mentors: Please complete required Raider Success Hub training and remain\n                                    FERPA-compliant. Questions mentors often ask before joining Mentor Tech: What if I’ve never been a mentor before?That’s totally okay—and actually pretty common!We’ll give you everything you need to get started, including training, a guidebook\n                                    with conversation tips, and support from the Mentor Tech team throughout the semester.\n                                    You don’t have to be perfect or have all the answers—just be willing to listen, share,\n                                    and show up. How does the matching process work?When you sign up, we’ll ask about your background, interests, availability, and preferences.\n                                    Based on that, we’ll match you with a first-year student who’s looking for support,\n                                    connection, and guidance.Our goal is to create matches that feel natural and helpful, and if anything isn’t\n                                    working—we’ll help with a rematch. How much time does this take?Mentorship is designed to fit your schedule. You’ll meet with your mentee at least\n                                    once a month (virtually or in person), complete a short interaction form afterward,\n                                    and stay in touch. Most mentors spend less than 2 hours per month. Can I mentor more than one student?Yes! If you’re open to it, you can let us know you’re available to support more than\n                                    one mentee. Do I need to attend events with my mentee?It’s not required, but it’s encouraged!Mentors are always welcome to join their mentee for social and professional development\n                                    meetups. These are great chances to bond, connect in a relaxed setting, and support\n                                    your mentee’s growth outside of one-on-one meetings. What if I don’t connect with my mentee?No worries—that happens sometimes!Just reach out to the Mentor Tech team and we’ll work with you to find a better fit.\n                                    We want the experience to be meaningful and beneficial for both of you. Becoming a Mentor Tech mentor is simple—and impactful. Here’s how to get started: Submit your interest form by this date for the best chance of being matched early\n                                    and receiving full training opportunities. We will continue to accept mentor applications\n                                    after this deadline as space allows, so feel free to reach out even if the date has\n                                    passed! Get connected, feel supported, and grow into the Red Raider you're meant to be. Mentor\n                              Tech will match you with someone who’s been where you are and can help you thrive\n                              in college and beyond.   Be a guide, a listener, and a support system for a first-year student navigating the\n                              ups and downs of college life. We’ll provide all the training and tools you need—just\n                              bring your passion for student success.",
      "url": "https://www.depts.ttu.edu/studentengagement/mentortech/MentorTech.php"
    },
    {
      "title": "MyTeamCare | Student Health Services  | TTU",
      "text": "MyTeamCare patient portal allows you to safely and conveniently communicate with your\n                        healthcare provider, access your medical records and more.  Your medical history and documents like medication lists, allergies, immunizations,\n                        health issues, surgeries, procedures, and some test results will be online.  Your health information within MyTeamCare is private and secure-it can be accessed\n                        with the password you choose. ",
      "url": "https://www.depts.ttu.edu/studenthealth/includes/MyTeamCare/"
    },
    {
      "title": "Student Mental Health Community | RISE | TTU",
      "text": " Risk Intervention & Safety Education  The Student Mental Health Community (SMHC) provides a supportive environment to help\n                        Texas Tech students establish, sustain, and enhance their mental health.   Our mission is to enhance and provide support for students' mental health through\n                        participating in a community of peers with support from trained staff. Students can\n                        gather in a safe space with like-minded peers to support, encourage, and provide friendship\n                        to each other while pursuing mental health and wellbeing. The SMHC space is located\n                        at the northeast corner on the 2nd floor of Weeks Hall near office 229 All Texas Tech undergraduate and graduate students are welcome to join our community.   • Drop-in space located on the 2nd floor of Weeks Hall  • Student kitchen • Peer meeting rooms • Study areas • Hang-out space for students • Weekly peer support groups to enhance mental health and wellbeing • Community lunches, movie nights, activities, and excursions • Online support overseen by staff through the Flare app • Collaborative connections with other Texas Tech University student resources Open: 8 AM - 5 PM In-Person Mental Health Meeting: 3 - 4 PM Open: 8 AM - 5 PM Online Mental Health Meeting: 12 - 1 PM Zoom Meeting ID: 625 240 6558 Open 8 AM - 5 PM In-Person Mental Health Meeting: 4 - 5 PM Open: 8 AM - 5 PM In-Person Mental Health Meeting: 3:30 - 4:30 PM Open: 8 AM - 5 PM Online Mental Health Meeting: 12 - 1 PM Zoom Meeting ID: 625 240 6558  ",
      "url": "https://www.depts.ttu.edu/rise/smhc.php"
    },
    {
      "title": "Group Therapy | Student Counseling Center | TTU | Student Counseling Center  | TTU",
      "text": "  In group therapy, people learn to catch themselves making the same old mistakes, try\n                                 out new approaches to problems, get support from other members, and get challenged\n                                 in a variety of ways. A group has one or two leaders who may facilitate interactions\n                                 in the group, challenge members to look at these interactions in a different way,\n                                 and offer feedback and support. Group members are actively involved, and are expected\n                                 to share their feelings and impressions to the extent to which they are comfortable.\n                                 The information discussed in group is confidential and group members agree to make\n                                 a commitment to that confidentiality before participating in the groups. You alone decide what to say and what not to say in group. It takes time for a group\n                                    of people to develop into a relationship. It is also normal to feel some anxiety about\n                                    talking in a group. Pace yourself. Disclose what you are ready to disclose. Like most\n                                    other things in life, however, you tend to get out of group what you put into it.\n                                    If you make an effort to talk about what brought you to counseling in the first place,\n                                    we are confident that you will have a positive experience. Along with the right not to discuss what you're not ready to talk about comes the\n                                    responsibility to initiate your own participation. It is each group member's responsibility\n                                    to tell the group what you need, provide feedback in a warm manner, share reactions\n                                    to other members, and express your present emotions. Group leaders are not mind readers,\n                                    and do not know when you want to say something. We also don't have all the answers,\n                                    though we certainly often wish we did! Don't forget that the other members of the\n                                    group may be another good resource for challenge, support, or suggestions. This may be the biggest myth about group therapy! In fact, research shows that group\n                                    participants usually experience equally satisfactory results as those who receive\n                                    individual counseling. Sometimes they even like it better! At our Counseling Center,\n                                    we use group, individual, and couple counseling based on the students' needs, not\n                                    on how busy our schedules are. Guidelines about how to participate in the group help keep the group a safe place\n                              for you and everyone else. If you join a group here, we ask that you comply with the\n                              following rules. Additional guidelines might be established by the group itself to promote a feeling\n                              of safety for group members. Other guidelines might be outlined by your group facilitators\n                              depending on the nature, size, and purpose of the different groups. You will be informed\n                              of these guidelines if they exist. Reviewed 5/1/23 \n\nContact Us\n\n\n\nIf you have any questions please call   806.742.3674. To initiate services, please come to our Walk-In Clinic hours.\n\n\n\n\nOFFICE HOURS\nMonday-Friday 8:00am-5:00pm\nWalk-In Clinic Hours \nMonday-Friday 12:30-3:30pm\nLOCATION\n\n\n\n  Second floor of the Student Wellness Center, Room 201   (on the corner of Flint Ave. & Main St.)\n GET DIRECTIONS \n\n\n \n\n\n  If you have any questions please call   806.742.3674. To initiate services, please come to our Walk-In Clinic hours. Monday-Friday 8:00am-5:00pm Monday-Friday 12:30-3:30pm   Second floor of the Student Wellness Center, Room 201   (on the corner of Flint Ave. & Main St.)     ",
      "url": "https://www.depts.ttu.edu/scc/treatment-services/group-therapy/"
    },
    {
      "title": "Couple, Marriage, and Family Therapy | Health & Human Sciences  | TTU",
      "text": " Couple, Marriage, and Family Therapy    Couple, Marriage, and Family Therapy Application Details » The Couple, Marriage, and Family Therapy graduate programs at Texas Tech University\n                        provide systemic clinical training to prepare students for clinical licensure and\n                        scholarly achievement. TTU is known for its supportive and rigorous programs and has\n                        one of the largest groups of CMFT faculty in the country. Our graduates have found\n                        success in a wide variety of academic, clinical, and other settings. The in-person/on-campus\n                        CMFT graduate programs include a doctoral and a master's program. The TTU CMFT programs\n                        are not offered online or in hybrid formats.  The CMFT doctoral program has a long and distinguished history of preparing students\n                        for contributions in academics, administration and clinical work. There is a strong\n                        emphasis on training in research methodology as well as theoretical and clinical sophistication.\n                        Many of TTU's doctoral graduates can be found in academic institutions around the\n                        country. The doctoral program has been accredited by the Commission on Accreditation\n                        for Couple, Marriage, and Family Therapy Education (COAMFTE) since 1981. Click here\n                        for the doctoral program mission statement. The master's program at TTU is a clinically-focused program grounded in relational/systemic\n                        theories of practice. The CMFT faculty provide training that prepares students for\n                        licensure as an MFT, LCDC, or for future doctoral work. The TTU CMFT master’s degree\n                        fulfills all course requirements of the Texas State Board of Examiners of Marriage and Family Therapists necessary to sit for the national licensure exam. The master's program has been accredited\n                        by the Commission on Accreditation for Couple, Marriage, and Family Therapy Education\n                        (COAMFTE) since May 1, 2019. The MS in Couple, Marriage, and Family Therapy prepares graduates to take the AMFTRB\n                           national licensure exam and meet requirements for licensure in the state of Texas\n                           as a marriage and family therapist. The MFT profession’s regulatory structure and\n                           licensure requirements, including qualifying degree requirements, may vary across\n                           state and provincial jurisdictions. Information regarding licensure requirements in\n                           other states and provinces can be found at AMFTB’s State Licensure Comparison.  Professional Lincensure Info  Students entering the program have a wide range of academic backgrounds. They not\n                        only come from all over the United States but the world. This diversity facilitates\n                        growth and fosters understanding. Texas Tech, as well as the Couple, Marriage, and Family Therapy program, is committed\n                        to the principle that in no aspect shall there be differences in the treatment of\n                        persons or discrimination with regard to the recruitment, admission, codes of conduct,\n                        hiring, retention, or dismissal of students, faculty, and supervisors or other relevant\n                        educators and/or staff on the basis of race, age, gender, ethnicity, sexual orientation,\n                        relationship status, gender identity, socioeconomic status, disability, health status,\n                        religion and spiritual beliefs and/or affiliation, and/or national origin. As part of the accreditation process, the CMFT programs track our students’ graduation\n                        rates, licensure rates for each cohort of students, and job placement where our students\n                        are employed in positions utilizing skills learned during their graduate education.\n                        The rates are available to the public at the links provided below. COAMFTE Graduate Achievement Criteria Data for Couple, Marriage, and Family Therapy\n                           Program (Doctoral) COAMFTE Graduate Achievement Data for Couple, Marriage, and Family Therapy Program\n                           (Master’s) (Master's) CMFT Mission Statement and Learning Outcomes Composition of Faculty and Students 2025- 2026 CMFT Master’s Program Manual 2024-2025 CMFT Master's Program Manual 2023-2024 CMFT Program Manual Doctoral Portfolio Example CMFT Newsletter",
      "url": "https://www.depts.ttu.edu/hs/mft/"
    },
    {
      "title": "Therapy Assistance Online | Student Counseling Center  | TTU",
      "text": " Student Counseling Center  TAO is an interactive, web-based program that provides well-researched and highly\n                              effective strategies to help ovrecome anxiety, depression, and other common concerns. With TAO, you will have access to highly effective therapy modules 24/7 and a dedicated\n                              time to meet with your counselor each week for a 20-30 minute appointment. Weekly exercises take approximately 15-30 minutes to complete and can be done on a\n                              smart phone, tablet, or computer. Interested in trying TAO with therapy? If you are already meeting with a counselor\n                              at the SCC, ask your therapist about TAO. If you are new to the Student Counseling\n                              Center, call 806.742.3674 for an initial appointment to get started. If you want to try TAO without meeting with an SCC counselor, click here for more information on how to set up a TAO Self-Help account.     Reviewed 5/13/25 \n\nContact Us\n\n\n\nIf you have any questions please call   806.742.3674. To initiate services, please come to our Walk-In Clinic hours.\n\n\n\n\nOFFICE HOURS\nMonday-Friday 8:00am-5:00pm\nWalk-In Clinic Hours \nMonday-Friday 12:30-3:30pm\nLOCATION\n\n\n\n  Second floor of the Student Wellness Center, Room 201   (on the corner of Flint Ave. & Main St.)\n GET DIRECTIONS \n\n\n \n\n\n  If you have any questions please call   806.742.3674. To initiate services, please come to our Walk-In Clinic hours. Monday-Friday 8:00am-5:00pm Monday-Friday 12:30-3:30pm   Second floor of the Student Wellness Center, Room 201   (on the corner of Flint Ave. & Main St.)    ",
      "url": "https://www.depts.ttu.edu/scc/tao/index.php"
    }
  ],
  "Physical Health ": [
    {
      "title": "Student Health Services | Student Health Services  | TTU",
      "text": " Student Health Services  Measles Information \n\n\n \n \n\n\n\n\n\n\n   Submit your immunization records.   Start your new patient registration here.   Manage your care as a returning patient.   See what's happening at Student Health Services.    Monday - Thursday:8am - 5:30pm Phones are closed from 12:30pm - 1pm Friday:8am - 12pm   Monday - Thursday:8am - 5:30pm(Open during lunch hour)  Friday:8am - 12pm   If you need medical assistance after hours.       SERVICES PROVIDED BY  ",
      "url": "https://www.depts.ttu.edu/studenthealth/"
    },
    {
      "title": "Texas Tech Physicians - Expert Clinical Care Backed by Pioneering Research",
      "text": " Texas Tech University Health Sciences Center is providing notice of a recent incident\n                                       which may impact the information of certain individuals. Updates can be found at ttuhscinfo.com. Be advised that service functionality may vary between clinics as systems return\n                                       online and in-person clinical care services fully recover. Click on your location below and use the provider ID to log in. Not sure how you’d like to pay?See all payment options \n                                          \t\t\t\t\t\t\t\t\t\t\tGet care from the comfort of home — schedule a virtual visit appointment\n                                          to talk to a clinician over the phone or via video using your computer or tablet device.\n                                          Most insurance plans accepted.\n                                          \t\t\t\t\t\t\t\t\t\t \n                                          \t\t\t\t\t\t\t\t\t\t\tHome to 8 clinical services: cardiology, endocrinology, family medicine,\n                                          internal medicine, orthopaedics (sports medicine), psychiatry, surgery and urology,\n                                          the 21,000 sq. ft. clinic features 51 exam rooms. Housed on the 3rd floor of UMC Health\n                                          & Wellness Hospital, this collaboration with University Medical Center provides patients\n                                          the most advanced diagnostic tests, infusion center, pharmacy and a state-of-the-art\n                                          medical fitness center that complements the multidisciplinary health care provided\n                                          by Texas Tech Physicians. \n                                          \t\t\t\t\t\t\t\t\t\t \n                                          \t\t\t\t\t\t\t\t\t\t\tHealth care experts from Texas Tech University Health Sciences Center share\n                                          advice and reminders to help us stay healthy — mentally and physically.\n                                          \t\t\t\t\t\t\t\t\t\t",
      "url": "https://www.texastechphysicians.com/"
    },
    {
      "title": "University Recreation | University Recreation | TTU",
      "text": " University Recreation     For Daily Hours, CLICK HERE  For 1,923 minutes, Red Raiders will unite to support the people and programs that\n                           shape our university. Every gift—whether $5 or $500—makes an impact. From scholarships\n                           to research initiatives, you can impact the area at Texas Tech that you are passionate\n                           about and see your contribution make an immediate difference! Let’s celebrate the\n                           Red Raider spirit of generosity and make 2025 the biggest Day of Giving in Texas Tech\n                           history! To make and early gift to a Sport Club,  CLICK HERE! \n\n",
      "url": "https://www.depts.ttu.edu/recreation/"
    }
  ],
  "Education and Academic Help ": [
    {
      "title": "The Learning Center | The Learning Center | Academic Innovation & Student Success | Office of the Provost  | TTU",
      "text": " The Learning Center   \n\n\n\n\n\n\n\n\n\n\n  The ultimate goal of the Learning Center is to provide a student with the resources\n                        needed to obtain academic independence and success. Through positive interaction and\n                        effective communication, a peer tutor is able to create an educational environment\n                        that inspires a student to develop autonomous learning strategies. The Learning Center offers FREE drop-in tutoring in subjects such as Math, Physics,\n                        Chemistry, Biology, Accounting, and Engineering (and many others). ______________________________ User Expectations Tutor Schedule Fall 2025 Weekend Schedule Course Listing 24/7 Online Tutoring (Tutor.com)   *All Tutoring is First-Come, First-Serve* *Tutors can work with NO MORE THAN 4 students at one time*  ________________________________________________________________________________ Learning Center tutoring will take place in Drane Hall, Room 164. Tutoring at the Library will take place in the Research Hub, Room 132. Tutoring at Chitwood/Weymouth/Coleman Halls will take place in the C/W Learning Center. Tutoring at Murray Hall will take place in Room 188 (across form Sam's Place).      ",
      "url": "http://depts.ttu.edu/provost/aiss/learning-center/"
    },
    {
      "title": "Supplemental Instruction | Academic Innovation & Student Success | Office of the Provost  | TTU",
      "text": " Supplemental Instruction   Supplemental Instruction (SI) provides a unique peer-to-peer learning experience in\n                        an interactive group environment called SI Sessions. The SI Sessions are regularly\n                        scheduled review sessions led by SI Leaders (undergraduate students) who have previously\n                        earned an A in the course. SI Leaders are trained on facilitation strategies, learning\n                        strategies and collaborative learning techniques to encourage student to student interaction.\n                        Students enrolled in a course where SI is offered will receive a weekly e-mail from\n                        your SI Leader(s) with session information. Our Purpose: To provide the best learning experience. We help students succeed in historically\n                           difficult courses by:•Offering peer led group review sessions•Engaging students in innovative ways•Creating connections   CLICK HERE FOR WEEKLY SCHEDULE   WANT TO BE AN SI LEADER OR SA?   FIND MY SI COURSE                       ",
      "url": "https://www.depts.ttu.edu/provost/aiss/supplemental-instruction/"
    },
    {
      "title": "Writing Centers of Texas Tech | Office of the Provost  | TTU",
      "text": "The Writing Centers of Texas Tech serves students from all majors and disciplines\n                        as they work to develop excellent written communication skills through one-to-one\n                        consultations, writing groups, workshops, resources, and other innovative programming.\n                        Writers from all backgrounds are empowered to pursue their individualized goals in\n                        academic, professional, and personal contexts. In order to best serve the writing\n                        needs of the Texas Tech community, our services are specialized for undergraduate\n                        and graduate students.    ",
      "url": "https://www.depts.ttu.edu/provost/uwc/"
    },
    {
      "title": "University Career Center | University Career Center  | TTU",
      "text": " University Career Center  Promoting the professional success of Texas Tech students and alumni, face-to-face\n                        and virtually Find internships, full-time positions, and on-campus jobs here! Identify top employers and salary data for Texas Tech alumni! Build your skillset and get experience related to your industry through our internship\n                                 placement program! Build your professional wardrobe with free clothing, available only to Texas Tech\n                                 students!",
      "url": "https://www.depts.ttu.edu/careercenter/"
    },
    {
      "title": "University Libraries | University Libraries  | TTU",
      "text": " University Libraries       ",
      "url": "https://www.depts.ttu.edu/library/"
    },
    {
      "title": "Course Reserves | University Libraries  | TTU",
      "text": " University Libraries  Document Delivery can help you make resources for teaching available through Course Reserves. Course materials can be anything that supports\n                              your teaching, including books, graphic novels, movies, documentaries, music scores,\n                              étude books, building sets, and much more--plus easy access to eBooks, chapter scans\n                              and journal articles! Place requests below as soon as you know what you're teaching to ensure access by\n                              the first day of class. For more information, visit our LibGuide.  To submit course reserve materials for the Main Library, please click the submit request\n                              button. For more assistance, please contact libraries.reserve@ttu.edu or (806) 742-2159. View Main Library Hours To submit course reserve materials for the Architecture Library, please contact libraries.architecture@ttu.edu to arrange for those materials to be placed on reserve at the Architecture Library. View Architecture Library Hours  Welcome What can go on Course Reserve? Policies & Procedures Copyright Information Find Course Reserves Course Reserves LibGuide Submit a Request",
      "url": "https://www.depts.ttu.edu/library/coursereserve/"
    },
    {
      "title": "Open Educational Resources | University Libraries  | TTU",
      "text": " University Libraries   The Texas Tech University Libraries Open Educational Resources (OER) Office promotes\n                              a successful learning environment by educating the university community on the benefits\n                              of open educational resource adoption in higher education. The Texas Tech University Libraries Open Educational Resources (OER) Office will serve\n                              as an advocate for student success and work to reduce the cost of learning materials\n                              in the Texas Tech University System. RAIDER Digital Publishing aims to publish textbooks and educational resources created\n                              by TTU faculty to be used in TTU classrooms. Interested in creating OER? Explore our\n                              PressbooksEDU platform to see what other authors have done! For questions about RAIDER Publishing,\n                              you can contact our OER Lead Administrator, Austin Moyers. Here are some examples of OER textbooks written by our faculty that can be found in\n                              Pressbooks: Sydney Brammer; Ryan Martinez; and Narissra Punyanunt-Carter Lisa Tatum Babu John-Mariadoss Harnessing the Power of Practical Reasoning for Effective Advocacy and ChangeCynthia L. Miller Ali Duffy; Student Authors     Reach out directly:Open Educational Resources Teamlibraries.oer@ttu.edu",
      "url": "https://www.depts.ttu.edu/library/oer/index.php"
    }
  ],
  "Wellness": [
    {
      "title": "Student Disability Services | Student Disability Services  | TTU",
      "text": " Student Disability Services   Texas Tech University has one of the most comprehensive departments for students with\n                              disabilities in the state of Texas. Student Disability Services (SDS) staff provide\n                              a variety of accommodations and services for individuals with disabilities. Accommodations\n                              are tailored to the individual and the disability. With over 2,000 students registered for services, we encourage students to overcome\n                              challenges and attain personal and academic success while the SDS staff functions as a student advocate. Through active involvement with all areas\n                              of the University, SDS is able to monitor conditions relevant to students with disabilities and offer support\n                              in decisions affecting their quality of life. In addition to the services offered by our main Student Disability Services office,\n                              SDS also offers a supplemental academic enhancement program for students with Learning\n                              Disabilities and Attention Deficit/Hyperactivity Disorders, the TECHniques Center. The TECHniques Center is a fee-for-service program that provides one-on-one, regularly\n                              scheduled content and study skills tutoring, as well as weekly meetings with an academic\n                              counselor.  Student Disability Services promotes each student's learning experience by providing\n                              programs and services for students with disabilities and education of the campus community\n                              on issues related to students' disabilities. The Department of Student Disability Services will become nationally recognized as\n                              the leader in enhancing student learning and development for students with disabilities\n                              through the provision of direct academic services such as classroom accommodations,\n                              tutoring, training, academic counseling, and ongoing campus training and education. Faculty, is the ADA statement on your syllabi up to date? A standard and mandatory syllabus statement has been published for you to use: (O.P. 34.22 and O.P. 40.04). View the mandatory Americans with Disabilities Act Syllabus Statement. Because we know the transition from active duty to a college classroom can be challenging,\n                                 SDS would like to make this transition as smooth as possible. Resources to accommodate a disability can open up educational opportunities. You may\n                                 email the SDS staff liaison for further information or contact the Military & Veterans Programs office at Texas Tech directly. Texas Tech University is committed to making every possible effort to ensure all electronic\n                                 and information technology developed, procured, maintained, or used is accessible\n                                 to individuals with disabilities. If you cannot fully access the information on a particular page, please email our IT Support Specialist for assistance. Faculty, to make your materials accessible, please follow the guidelines described\n                                 on our accessibility web page. For more information, please email SDS, or call (806) 742-2405.",
      "url": "https://www.depts.ttu.edu/sds/"
    },
    {
      "title": "Risk Intervention & Safety Education | RISE | RISE | TTU",
      "text": " Call the Texas Tech Crisis Helpline at 806.742.5555. This 24/7/365 helpline assists\n                           students experiencing suicidal thoughts, mental health crises, sexual assault, and\n                           interpersonal violence Report a concern. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n We help students live vital, meaningful lives through prevention education and holistic\n                           well-being strategies. We host presentations, workshops, and resource tables; coach students about their substance use and wellness using individualized harm reduction strategies; provide mental health resources to students; and so much more. View Our Upcoming Events   Raider's Report Mental Health Services RISE Monthly Events Student Support Offices/Departments Raider Restart BASICS Suicide Prevention",
      "url": "https://www.depts.ttu.edu/rise/"
    },
    {
      "title": "Center for Students in Addiction Recovery | Health & Human Sciences  | TTU",
      "text": "Vision: All students in addiction recovery will achieve a higher education within an interconnected\n                                 community.  Mission:CSAR believes in the power of education and the ability of students in addiction recovery\n                                 to transform their lives. To facilitate success, we utilize a comprehensive approach\n                                 which includes financial, academic, and recovery support in a compassionate environment.\n                                 Through dynamic connections, we foster personal growth, academic achievement, and\n                                 increased awareness.  Welcome to the Center for Students in Addiction Recovery (CSAR), formerly the Center\n                                 for Collegiate Recovery Communities, at Texas Tech University. Established in 1986,\n                                 the CSAR offers students in recovery a nurturing and supportive community.  This specialized\n                                 recovery and academic support increases the chances that recovering students will\n                                 flourish with strengthened recovery, personal and professional growth, and academic\n                                 achievement, including retention in school, high GPAs, and graduation rates. CSAR offers scholarships for undergraduate and graduate students in recovery. These\n                                 scholarships often offer students a second chance at higher education and advanced\n                                 degrees in their choice of academic fields at Texas Tech University and the Texas\n                                 Tech University Health Sciences Center. Founded on elements of 1) continuous recovery,\n                                 2) connectedness in community, 3) commitment to academics, and 4) civility in relationships,\n                                 the CSAR lays a solid foundation for student growth in recovery, academically, personally,\n                                 and professionally.  Are you a former student of the center? We want to hear from you! Help us out by completing\n                                 our CSAR study.",
      "url": "https://www.depts.ttu.edu/hs/csa/"
    },
    {
      "title": "Raider Restart | RISE | TTU",
      "text": "Raider Restart provides personalized, one-on-one sessions with a trained facilitator\n                        to discuss and reflect on alcohol and cannabis use. Our aim is to foster a healthy,\n                        non-judgmental conversation about substance use, empowering you to make informed decisions. This program is tailored to provide individualized education on substance use, emphasizing\n                        its impacts on your health, wellness, and academic success. Our goal is to support\n                        you in making safer, healthier choices and avoid the negative consequences substance\n                        use can bring. Our coaching sessions are sanctioned by the Office of Student Conduct and are facilitated and managed by RISE. Please refer to your letter from Student\n                        Conduct when selecting your session. Interested in accessing free wellness coaching? Schedule a session today or view Texas Tech's Substance Use & Wellness Initiatives. Kindly provide advanced notice for all appointments. No-call, no-shows, and cancellations\n                        within 24 hours are subject to a $25 fine. If you need to cancel or reschedule your\n                        session, please give at least 24-hour notice. Schedule a Meeting",
      "url": "https://www.depts.ttu.edu/rise/RaiderRestart.php"
    },
    {
      "title": "Office of the Provost, Student Life | Dean of Students  | TTU",
      "text": " Dean of Students Office   The Dean of Students Office supports students through non-academic matters affecting\n                        student life, success and learning.  We are here for YOU Student of Concern Report Faulty and Staff Resource Raider Report Online Reporting Student Involvement  Have you noticed a students behavior that may impact their ability to be successful\n                              in the University enviornment? Submit a Student of Concern Report.       Student Academic Resource Raider Relief Student Handbook Tech Connect Red Folder    @ttudeanstudents        ",
      "url": "https://www.depts.ttu.edu/dos/"
    },
    {
      "title": "Main Page | Campus Access & Engagement | TTU",
      "text": " Campus Access & Engagement  Campus Access & Engagement signifies Texas Tech University’s commitment to student\n                        success. We connect students and community members to academic, social, and professional\n                        development opportunities that support student success. By encouraging involvement\n                        in campus life and leadership programs, the office helps foster personal growth, achievement,\n                        and a strong sense of community. It also supports outreach to prospective students,\n                        showcasing the opportunities available at Texas Tech. Works to develop partnerships with Lubbock area businesses, school districts, faith-based\n                                    organizations, nonprofit organizations, alumni groups, and others in support of the\n                                    strategic priorities of the university and advancement of the academic experience. Provides high school students with unbiased competitions in academic, athletic and\n                                    theater events, provides quality venues, and promotes partnerships and collaborations\n                                    with local and regional educators and business establishments. Amplifies the University’s HSI status by providing programs, activities, and professional\n                                    development opportunities to foster a sense of belonging for all students, while supporting\n                                    student enrollment, retention, and graduation rates especially among underrepresented,\n                                    first-generation, low-income, rural students.  Academic, and college preparatory programs federally funded by the U.S. Department\n                                    of Education that promote academic skills and motivation necessary for students to\n                                    graduate high school and enter post-secondary education. Includes Upward Bound, Upward\n                                    Bound Math & Science and McNair Scholars. Focuses on a student-centered approach to explore and affirm shared humanity through\n                                    intentional coalition building, holistic resources, scholarly activities, and consistent\n                                    community outreach to educate our student body, faculty, and staff.  Serves as a hub for workshops and other special events designed to empower and educate\n                                    participants to use their lived experiences to serve as change makers in the TTU community\n                                    and beyond. Programs through Intercultural Education and Engagement (IEE) are also\n                                    housed here. Read the 2023-2024 Annual Report Here  Campus Access & Engagement is currently reviewing our funding application, process\n                        and protocols. Once this review is finalized, the updated application will be available\n                        here.  We anticipate the application will be available by Fall 2025. Please check back for\n                        updates.  Upload Events to TechConnect+ SB17 Student FAQ SB17 Faculty FAQ  ",
      "url": "https://www.depts.ttu.edu/access-engagement/"
    },
    {
      "title": "Manage Your Mood | Student Counselling Center | TTU | Student Counseling Center  | TTU",
      "text": "While Manage Your Mood is more engaging and adaptive to specific student needs in\n                                 person, TTU students and staff can view a pre-recorded version of each workshop. Perfect\n                                 for students who can't make the in-person meeting time or distance learners! Click\n                                 on each section below to get started. Manage Your Mood: Introduction  Manage Your Mood: Core Mindfulness  Manage Your Mood: Interpersonal Effectiveness and Conflict Resolution Manage Your Mood: Distress Tolerance and Radical Acceptance Manage Your Mood: Emotional Regulation   Manage Your Mood: Resilience and Confronting Irrationality  Manage Your Mood is a four-week life skills group designed to address mild depression,\n                                 excessive worry, and anxiety by giving tools needed for healthier outcomes. Manage\n                                 Your Mood emphasizes mindfulness techniques, healthy emotion management, coping with\n                                 situations which seem overwhelming and interacting with others in a more effective\n                                 manner. These concepts guide weekly interventions. Manage Your Mood meets weekly throughout the academic year. If you are new to the\n                                 SCC, come to the Walk-In Clinic and ask your initial assessment counselor about Manage Your Mood. You can also access\n                                 Manage Your Mood Online to watch videos of each session. For more information, please\n                                 contact  Greg Johnston. Spring 2025 Day and Time: Tuesday at 2:30pm   Reviewed 1/28/25 \n\nContact Us\n\n\n\nIf you have any questions please call   806.742.3674. To initiate services, please come to our Walk-In Clinic hours.\n\n\n\n\nOFFICE HOURS\nMonday-Friday 8:00am-5:00pm\nWalk-In Clinic Hours \nMonday-Friday 12:30-3:30pm\nLOCATION\n\n\n\n  Second floor of the Student Wellness Center, Room 201   (on the corner of Flint Ave. & Main St.)\n GET DIRECTIONS \n\n\n \n\n\n  If you have any questions please call   806.742.3674. To initiate services, please come to our Walk-In Clinic hours. Monday-Friday 8:00am-5:00pm Monday-Friday 12:30-3:30pm   Second floor of the Student Wellness Center, Room 201   (on the corner of Flint Ave. & Main St.)  ",
      "url": "https://www.depts.ttu.edu/scc/treatment-services/manage-your-mood/index.php"
    }
  ],
  "Emergencies": [
    {
      "title": "Texas Tech Police | TTPD  | TTU",
      "text": "Staying safe while riding with Uber   More »\n Scholarship Criteria: Scholarship funds will benefit undergraduate or graduate students in the Institute for Forensic Science or in the Criminology Concentration for Sociology majors at Texas Tech University. The scholarship will have         a preference for students who are from the El Paso area.   More »\n Is to provide an environment of care and concern for families and officer co-workers of law enforcement officers killed in the line of duty. Letting them know they are not alone in their grief.   More »\n Follow us on Twitter @TexasTechPD   More »\n Map of Crimes for the Lubbock Campus   More »\n What you need to know about Campus Carry   More »\n Active Shooter video featuring Eric Williams.   More »\n Campus shooting incidents are unpredictable. Your immediate response will depend upon the specific situation you face. Click on More to find more information about what you should do in the event a shooting situation erupts on campus.   More »\n The Texas Tech Police Department is currently accepting applications for employment. Click on More for additional information.   More »\n Our goal is to provide a safe and secure environment to live, learn, and educate.\n                               A safe and secure campus requires students, staff, faculty, and visitors to be vigilant\n                              and report all criminal and suspicious activities to the Texas Tech Police Department.  Our website provides a variety of crime prevention and safety information.  In keeping\n                              with our community oriented philosophy, the Texas Tech Police Department works closely\n                              with the faculty, staff, and students on crime prevention and security programs. \n                              We provide 24 hour law enforcement and security services for the Texas Tech University\n                              and the Texas Tech University Health Sciences Center locations. We are located at 413 Flint Avenue, and our main number is 806 742-3931, please visit\n                              or call our office at any time to discuss any safety concerns or issues. Respectfully, Kyle K. Bonath Chief of Police   There has been an emergency reported at Texas Tech University. Please visit http://www.depts.ttu.edu/communications/emergency for more info.",
      "url": "https://www.depts.ttu.edu/ttpd/"
    },
    {
      "title": "Crisis Intervention Services | Student Counseling Center | | Student Counseling Center  | TTU",
      "text": "  If you are a student in immediate crisis and one of the following applies to you Please do one of the following: There are a variety of behaviors that may indicate that a student is in distress.\n                                 These behaviors include: Be aware that there is no “perfect formula” for interacting with a distressed student.\n                                       It is very important to know your personal limits as a helper. It is also important\n                                       to be mindful that there are times when effectively listening, offering encouragement,\n                                       and empathizing with the student can help the student feel cared about as an individual\n                                       and more confident in his or her ability to make decisions during stressful times. Here are some suggestions that might assist you when interacting with a distressed\n                                          student: Circumstances that may indicate that a referral is necessary may include the following: When faculty or staff members decide to refer a student to the SCC, we recommend the\n                                          following: It is important to remember to take all suicidal/homicidal expressions seriously!!\n                                    An SCC crisis therapist is available between 8 a.m. and 5 p.m. Monday through Friday.\n                                    After-hours concerns should be directed to Campus Police (806-742-3931) or to the Texas Tech Crisis HelpLine (806-742-5555). Please remember that all SCC contacts with students are confidential. Information\n                                 about SCC contact with students cannot be released except under specific circumstances. Texas Tech University Student Counseling Center\n                                 strictly adheres to this policy, which is in accordance with Texas state law. If you are wondering about the student's follow-through with the referral, we recommend\n                                 that you contact the student directly. You are welcome to share information regarding a student with SCC staff. However,\n                                 SCC staff must abide by the above guidelines and will not be able to respond without\n                                 the student's consent. \n\nContact Us\n\n\n\nIf you have any questions please call   806.742.3674. To initiate services, please come to our Walk-In Clinic hours.\n\n\n\n\nOFFICE HOURS\nMonday-Friday 8:00am-5:00pm\nWalk-In Clinic Hours \nMonday-Friday 12:30-3:30pm\nLOCATION\n\n\n\n  Second floor of the Student Wellness Center, Room 201   (on the corner of Flint Ave. & Main St.)\n GET DIRECTIONS \n\n\n \n\n\n  If you have any questions please call   806.742.3674. To initiate services, please come to our Walk-In Clinic hours. Monday-Friday 8:00am-5:00pm Monday-Friday 12:30-3:30pm   Second floor of the Student Wellness Center, Room 201   (on the corner of Flint Ave. & Main St.)     ",
      "url": "https://www.depts.ttu.edu/scc/crisis-intervention-services/"
    },
    {
      "title": "Title IX | Title IX  | TTU",
      "text": " Title IX   Location: Doak Hall 129.     Under the United States Code of Federal Regulations, Title IX states that, \"No person\n                              in the United States shall, on the basis of sex, be excluded from participation in,\n                              be denied the benefits of, or be subjected to discrimination under any education program\n                              or activity receiving Federal financial assistance.\" 20 USCA § 1681. Texas Tech is committed to providing its students, faculty, and staff with an educational\n                              and workplace environment free from any form of unlawful discrimination. The Texas\n                              Tech community is dedicated to fostering and supporting a culture of mutual respect\n                              and communication. Texas Tech University does not tolerate discrimination or harassment\n                              of students based on or related to sex, race, national origin, religion, age, disability,\n                              protected veteran status, or other protected categories, classes, or characteristics.\n                              Actions related to admission, discipline, housing, extracurricular and academic opportunities\n                              shall not be made based on a student’s protected status. Discriminatory behavior is\n                              prohibited regardless of the manner in which it is exhibited, whether verbally, in\n                              writing, or electronically displayed or conveyed. Individuals who violate these policies\n                              and laws are subject to disciplinary action, up to and including expulsion. Examples of the types of discrimination and violence that are strictly prohibited\n                              by Texas Tech include but are not limited to: sexual harassment, the failure to provide\n                              equal opportunity in athletics, discrimination in a school's science, technology,\n                              engineering, and math (STEM) courses and programs, discrimination based on pregnancy. In addition to Title IX, certain Clery specific crimes are also considered to be Title\n                              IX violations and will be handled by the university as mandated under both statutory\n                              requirements. These include but are not limited to sexual misconduct, domestic violence,\n                              dating violence, and stalking.      ——— ",
      "url": "https://www.depts.ttu.edu/titleix/"
    },
    {
      "title": "Office of Student Conduct | Office of Student Conduct  | TTU",
      "text": "   The Office of Student Conduct (OSC) is open Monday - Friday, 8:00am to 5:00pm.  If we are requesting you meet with our office, you will receive email communication\n                              via “Maxient” with additional details. If you would like to file a report, please see the options below. If you have any questions or need assistance, please contact us at: studentconduct@ttu.edu or 806-742-1714.    ",
      "url": "https://www.depts.ttu.edu/studentconduct/"
    },
    {
      "title": "Raider Relief – Advocacy and Resource Center | Raider Relief - Advocacy and Resource Center | TTU",
      "text": " Raider Relief - Advocacy and Resource Center  At the Raider Relief Advocacy and Resource Center, we are dedicated to creating a\n                           supportive community where all students can thrive. We provide a welcoming space and\n                           essential resources to help those facing challenges with basic needs. Through collaboration\n                           with campus and community partners, we aim to empower students by easing financial,\n                           physical, and emotional burdens, fostering their well-being and academic success.  Basic needs are the essential requirements necessary to survive life. Below includes\n                              what we can help with: If you answered “yes” to any of these situations, please do not hesitate to fill out\n                              an application form ***Raider Relief is not a scholarship nor can we assist with tuition and fees.  In the 2023-2024 academic year, the Raider Relief Fund supported 439 applications,\n                              with 82% connected to community resources, disbursing over $43,681.15 to help students\n                              focus on their education without the burden of financial stress. Student Success Stories: “I normally hate reaching out for help, and often times find it insulting to myself,\n                                 but the help I received allowed me to finally get a laptop for classes, and I was\n                                 able to afford groceries and come up with the rent I was short for the rest of the\n                                 semester.” Raider Red’s Food Pantry Pregnant and Parenting Students – Title IX Fostering the Future Financial Wellness and Literacy – Red to Black  ",
      "url": "https://www.depts.ttu.edu/raiderrelief/"
    }
  ],
  "Travel": [
    {
      "title": "Raider Ride | Transportation & Parking Services  | TTU",
      "text": " Transportation & Parking Services  Beginning January 16, 2024, students can download the new TechRide app to request a ride with Raider Ride. Raider Ride is a nighttime shuttle service that provides students with on-demand rides\n                        on campus from 6pm-2:45am, 7 days a week. To request a ride during service hours please follow the steps below: 1)      Download the TechRide app (Available in the App Store & Google Play) 2)      Sign in with your TTU eRaider credentials.  3)      Select your pickup/drop off location and request a ride. *A valid student ID is needed. Raider Ride uses white 10-passenger vans as well as\n                        minivans for service, both with marked with TTU branding . For more information, visit transportation.ttu.edu or call Transportation and Parking\n                        Services at 806-742-7275.   Raider Ride operates from the night before the first day of class through the Sunday\n                        morning following commencement during the fall, spring, and summer II semesters. For\n                        summer I, Raider Ride operates from the first day of class through the morning following\n                        the last final. Raider Ride does not operate on Texas Tech holidays.   Interested in driving for Raider Ride? Contact transportation@ttu.edu!   ",
      "url": "https://www.depts.ttu.edu/parking/InformationFor/MobilitySolutions/RaiderRide.php"
    }
  ],
  "Food": [
    {
      "title": "Raider Red's Food Pantry | Raider Relief - Advocacy and Resource Center | TTU",
      "text": " Raider Relief - Advocacy and Resource Center  FP Fall 25 hours    What is the purpose of Raider Red's Food Pantry? Raider Red's Food Pantry provides supplemental non-perishable food and hygiene items\n                              to students who may face hardships, and  is designed to complement other resources\n                              available. Students experiencing long-term hardships are encouraged to contact the Raider Relief\n                              - Advocacy & Resource Center (RRARC) for additional assistance.    Raider Red's Food Pantry Guidelines: Users will be required to complete a brief intake form during the registration process.\n                              No proof of income is required to access Raider Red's Food Pantry. @raiderrelief      Please note that Raider Red's Food Pantry will follow any weather-related delays/instructions\n                              as released by Texas Tech University. Students not able to visit the food pantry at these times, please email foodpantry@ttu.edu.  Contact Us! Phone number: (806) 742-1932Email: foodpantry@ttu.edu For TTUHSC Students:    What if I need additional assistance aside from food? Visit our Raider Relief- Advocacy and Resource Center page for additional on-campus resources and off-campus referrals. These resources\n                              include academic success strategies, child care, employment, financial counseling,\n                              housing options, and more.    ",
      "url": "https://www.depts.ttu.edu/raiderrelief/foodpantry.php"
    },
    {
      "title": "Fall & Spring | Dining Hours | Hospitality Services  | TTU",
      "text": " Hospitality Services       All dining hours, locations, and Transact MobileOrdering availability subject to change\n                        ",
      "url": "https://www.depts.ttu.edu/hospitality/dining_hours.php"
    },
    {
      "title": "Mobile Ordering | Transact | Hospitality Services  | TTU",
      "text": " Hospitality Services  Download Now Students are able to use the Transact Mobile Ordering App to order food for pickup\n                           with an on-campus Dining Plan from Hospitality Services. All on-campus Dining Plans\n                           will work exactly as they normally do with the same Dining Plan discounts and no fee\n                           for placing an order through the app! Check out the video on how to download Transact Mobile Ordering App! When placing\n                           your first order, be sure to select your correct on-campus Dining Plan at checkout!",
      "url": "https://www.depts.ttu.edu/hospitality/Transact.php"
    }
  ],
  "Legal": [
    {
      "title": "Student Legal Services | Student Legal Services  | TTU",
      "text": " Student Legal Services  \nGave me understanding and hope that my issue could be resolved.University College, Senior\n   Please call (806) 742-3289 to schedule an appointment with an attorney.  Appointments\n                        are available Monday through Thursday between 9am and 4pm. Notary services are also available. You only need a notary appointment if you have numerous documents. \n                        Please walk-in if you only have one or two documents needing notarization.   We provide legal advice, counsel and limited representation for currently enrolled\n                        students at TTU. Our licensed attorneys can advise and/or represent students in variety\n                        of legal areas including, but not limited to: landlord/tenant disputes, expunctions,\n                        misdemeanors, name changes, essential needs licenses, and small claims consumer disputes. More about our services. SLS is staffed by two full-time licensed attorneys, an administrative business assistant\n                              and law clerks.View Attorney Profiles  Answers to frequently asked legal questions.View Frequently Asked Questions Information on this site is provided for general informational purposes and does NOT\n                              constitute legal advice. Students should seek verification and clarification of all statements made on this\n                           website through our office. Slight variations in facts and circumstances may make\n                           an enormous difference in the legal advice that a particular attorney will render.\n                           Students who are confronted with legal problems or who desire specific advice, should\n                           make an appointment with an attorney at Student Legal Services or seek the assistance\n                           of another licensed attorney. By maintaining this website, Texas Tech University Student Legal Services is not forming\n                           any attorney-client relationships. All information contained on this site pertains\n                           to Texas law, and should not be relied upon as law in any other state. We cannot guarantee\n                           that the information on this site is up to date and accurate, as the laws affecting\n                           Texans are in constant transition. This web site contains links to other resources on the Internet. The links are provided\n                           as aids to help our students identify and locate internet resources that may be of\n                           interest, and are not intended to imply that we sponsor or are affiliated or otherwise\n                           associated with the creators of said sites. Texas Tech Student Legal Services is not\n                           responsible for the content or validity of information found on any websites herein\n                           linked. You further acknowledge that nothing in this Web site is intended to nor constitutes\n                           the practice of law or giving of legal advice.  ",
      "url": "https://www.depts.ttu.edu/sls/"
    }
  ],
  "Financial": [
    {
      "title": "Red to Black Peer Financial Coaching | Red to Black  | TTU",
      "text": " Red to Black    Schedule an Appointment Red to Black® Peer Financial Coaching is a nationally recognized model program staffed by students\n                        pursuing Personal Financial Planning degrees. We provide financial education and awareness\n                        to students through individual coaching sessions, presentations, outreach booths and\n                        resource referrals. We cover topics such as:   Our purpose is to empower students so that they can achieve their financial goals.\n                        We believe that no one understands the needs and concerns of students better than\n                        fellow students!    ",
      "url": "https://www.depts.ttu.edu/r2b/"
    },
    {
      "title": "Student Business Services | Student Business Services  | TTU",
      "text": " Student Business Services  ",
      "url": "https://www.depts.ttu.edu/studentbusinessservices/"
    }
  ],
  "Fitness": [
    {
      "title": "Outdoor Pursuits | University Recreation | TTU | University Recreation | TTU",
      "text": " Learn more about everything that our Outdoor Pursuits department has to offer!",
      "url": "https://www.depts.ttu.edu/recreation/UREC_DEPT_LANDING_PAGES/OPC_LANDING.php"
    },
    {
      "title": "Intramural Sports Registration | University Recreation | TTU | University Recreation | TTU",
      "text": " University Recreation  Download the IMLeagues app from either the App Store or Google Play Store: See the below tabs for additional information about IMLeagues Registration More Information For questions, please contact the Sport Programs Office at recreation.intramurals@ttu.edu or 806-742-2945 Monday -- Friday from 9:00AM - 5:00PM or stop by room 203. Policies Review the Intramural Sports Policies and Procedures to learn more. ",
      "url": "https://www.depts.ttu.edu/recreation/intramurals/imregistration.php"
    },
    {
      "title": "Sport Programs | University Recreation | TTU | University Recreation | TTU",
      "text": " Learn more about everything that our Sport Club program has to offer!",
      "url": "https://www.depts.ttu.edu/recreation/UREC_DEPT_LANDING_PAGES/SPORT_SPC_LANDING.php"
    },
    {
      "title": "Fitness/Wellness | University Recreation | TTU | University Recreation | TTU",
      "text": " University Recreation   Learn more about everything that our FIT/WELL department has to offer! Kickstart your fitness career with Texas Tech University Recreation certification\n                                       courses offered throughout the year.",
      "url": "https://www.depts.ttu.edu/recreation/UREC_DEPT_LANDING_PAGES/FITWELL_LANDING.php"
    },
    {
      "title": "Aquatics Landing | University Recreation | TTU | University Recreation | TTU",
      "text": " Learn more about everything that our Aquatics department has to offer!",
      "url": "https://www.depts.ttu.edu/recreation/UREC_DEPT_LANDING_PAGES/AQ_LANDING.php"
    },
    {
      "title": "Summer Youth Programs | University Recreation | TTU | University Recreation | TTU",
      "text": "Learn more about everything that our Summer Youth Program has to offer!",
      "url": "https://www.depts.ttu.edu/recreation/UREC_DEPT_LANDING_PAGES/SYP_Landing.php"
    }
  ],
  "Technology": [
    {
      "title": "Welcome to the Library Makerspace! | University Libraries  | TTU",
      "text": " University Libraries  The Texas Tech University Library offers a newly-expanded Makerspace with 3D printing,\n                                 3D scanning, laser cutting, textiling, and other maker technology in an area available\n                                 to all students, faculty, and staff. Our mission is to provide excellent service in helping you develop your ideas and\n                                 bring them to life.  While some services cost a nominal fee, which helps us cover\n                                 the cost of materials and maintenance of the hardware, we have expertise and tools\n                                 available for free! The Makerspace is located on the second floor East of the Library, in room 210, near\n                                 the DMS. If you already have a file that is ready to be printed, please bring it to the Makerspace\n                                 with your ideas and specifications.   If you are not sure where to get started with 3D printing and modeling, check out\n                                 some of the resources that can help you find, design, and develop your own 3D files, or visit the Makerspace\n                                 and let us help you bring your ideas to life! If you have any questions, or for information on faculty support for 3D printing,\n                                 please contact make@ttu.edu. WELCOME HOW DO I...?SERVICES RESOURCES POLICIES WORKSHOPS TODAY'S HOURS2pm - 8pm (View All Hours ») 2pm - 8pm (View All Hours ») CONTACT US Room 210, Second Floor EastUniversity Library Email: make@ttu.edu",
      "url": "https://www.depts.ttu.edu/library/make/index.php"
    },
    {
      "title": "Anatomy Models | University Libraries  | TTU",
      "text": " University Libraries  The University Libraries offers Anatomy Models in Dynamic Media Services (DMS), room\n                        205. Below is a list of the models available. See the Borrowing Policies page for details about checking out models. ",
      "url": "https://www.depts.ttu.edu/library/access-services/anatomy-models.php"
    },
    {
      "title": "Podcast Studios | University Libraries  | TTU",
      "text": " University Libraries  Reserve time in the Podcast Studios. Welcome to the Texas Tech University Libraries Podcast Studios! Through a generous donation by Todd & Linda Smith, the Texas Tech University Libraries\n                              offer two complete studios designed to record spoken word for podcasts. Both studios\n                              have the Equipment & Software needed to record, edit and produce professional quality podcasts.  The studios are\n                              free for all students, faculty, and staff of Texas Tech University. Total active reservation time can be up to 6 hours in a 24 hour period.  Keys can be picked up at the DMS service desk with your TTU ID. If you do not arrive\n                              within 15 minutes of your reservation the room will be checked out on a first come\n                              first serve basis. Please return the room key to the DMS service desk a few minutes before the end of\n                              your reservation. There is a 30 minute window between all bookings so that staff may\n                              reset the room. This space is intended for the recording of spoken word only. For more advanced or\n                              other audio recording, please visit the Crossroads Recording Studio. Drinks are permitted if they are in a spill-proof container. Food is not allowed. For help, contact libraries.recording@ttu.edu or 806-742-2250. Podcast Studios Quick Start Guide Equipment Spring & FallMonday - Thursday 10am - 12amFriday 10am - 10pmSummerMonday - Thursday 10am - 10pmFriday 10am - 7pm For questions, assistance, or troubleshooting, please contact us at libraries.recording@ttu.edu or (806)742-2250.  ",
      "url": "https://www.depts.ttu.edu/library/podcast-studio/index.php"
    },
    {
      "title": "Welcome to the Studio | University Libraries  | TTU",
      "text": "Contact libraries.recording@ttu.edu for booking. The Crossroads Recording Studio (CRS) is a professional multi-track recording facility\n                                 with experienced recording engineers on staff.   CRS is experienced in recording projects\n                                 of diverse musical styles, jingles voice-overs, 5.1 and audio for video. The studio is free for all students, faculty, and staff of Texas Tech. Our mission is to provide services and educational experiences to students and employees\n                              of Texas Tech University. Please read the Terms and Conditions before booking time and check out the Helpful Tips for more information about recording in the studio.   WELCOME STUDIO GEAR HELPFUL TIPS TERMS AND CONDITIONS REQUEST STUDIO TIME STUDIO HOURS  Monday - Friday 8 a.m. - 5 p.m. Contact us for additional availability. CONTACT US Phone: (806) 742-2250 Email: libraries.recording@ttu.eduLibrary Basement, Rm 13  ",
      "url": "https://www.depts.ttu.edu/library/crossroadsrecordingstudio/index.php"
    },
    {
      "title": "TTU Innovation Hub at Research Park | Research Home  | TTU",
      "text": "Texas Tech University Scroll Down Research Park The Hub is a place to nurture smart ideas and entrepreneurs to create a social or\n                              commercial value resulting in impact. The Hub assists in the formation of technology\n                              startup companies critically relevant to today's local and regional economy. Startups\n                              create 80%+ of net new jobs, new industries and new solutions.   $89200000 125691 Students, faculty, and community members that walk through our doors to attend any\n                              of our events per year. 277 This metric represents the cumulative NSF I-Corps teams and startup companies formed\n                              by the Hub.  42000 A community paying it forward, this number represents the cumulative hours supporting\n                              our innovation and entrepreneur ecosystem. The cornerstone of our Ideation, Commercialization,\n                              and Acceleration programming is the iTTU Mentors. Upcoming 10.01 Join our community of entrepreneurs! Present your small business by applying, here. 11.05 Join our community of entrepreneurs! Present your small business by applying, here. 12.03 Join our community of entrepreneurs! Present your small business by applying, here. 01.07 Join our community of entrepreneurs! Present your small business by applying, here. \n\n\n\nThe\nBuzz\n\n\n\n\n\n\n\n\n\n\nBridging Industry Expertise and Entrepreneurial Education\n\n\nThe Buzz\n\n\n\n\n\n\nBig Ideas, Big Wins: The 2024 Prototype Fund Awardees\n\n\nThe Buzz\n\n\n\n\n\n\nCelebrating Bold Ideas: Over $18K in Prizes Awarded at the 2024 Fall Finale\n\n\nThe Buzz\n\n\n\n\n\n\nFrom Research to Reality: Dr. Chanaka Kahathuduwa Named 2024 Emerging Inventor\n\n\nThe Buzz\n\n\n\n\n\n\n2024 Red Raider Startup Spurs Innovation Across Disciplines\n\n\nThe Buzz\n\n\n\n\n\n\n\n\n\n\n\n See More Buzz\n\n\n\n\n\n The Bridging Industry Expertise and Entrepreneurial Education Big Ideas, Big Wins: The 2024 Prototype Fund Awardees Celebrating Bold Ideas: Over $18K in Prizes Awarded at the 2024 Fall Finale From Research to Reality: Dr. Chanaka Kahathuduwa Named 2024 Emerging Inventor 2024 Red Raider Startup Spurs Innovation Across Disciplines ",
      "url": "https://www.depts.ttu.edu/research/research-park/"
    }
  ],
  "Entertainment": [
    {
      "title": "Late Night Movies | Student Activities Board | Student Union & Activities  | TTU",
      "text": " Student Activities Board  **Seating is limited! Arrive early.**\n                              \tFree with TTU Student ID!\n                           \tFree popcorn and drink provided by Hospitality Services\n                           \n                           \t\n                           \t Dates and titles subject to change.\n                            \n                           \tQuestions? Call Student Activities at 806-742-4708 or email us at sab@ttu.edu.\n                           \t",
      "url": "https://www.depts.ttu.edu/sub/Activities/movies/index.php"
    },
    {
      "title": "Hall Star Olympics Event | Flickr",
      "text": "by Texas Tech University - University Student Housing \n",
      "url": "https://www.flickr.com/photos/ttustudents/albums/72177720320222445/"
    },
    {
      "title": "\r\n\t2025 Football Gameday\r\n",
      "text": "",
      "url": "https://texastech.com/feature/gameday-2025"
    },
    {
      "title": "Men's Basketball - Texas Tech Red Raiders",
      "text": "Sports Men's Sports Women's Sports TexasTechMBB Men's Basketball September 09, 2025 Schedule Officially Signed: LaTrell Hoover Follow Hoover on X Tech, Arkansas to renew rivalry in downtown Dallas Schedule TBA TBA Lubbock, Texas Men's Basketball vs Lindenwood TBA TBA Lubbock, Texas Men's Basketball vs Sam Houston TBA Men's Basketball at Illinois TBA TBA Lubbock, Texas Men's Basketball vs Milwaukee 7:30 p.m. Men's Basketball vs Wake Forest   View Full Calendar  Men's Basketball August 26, 2025 Tech, Duke set for MSG showdown Schedule Men's Basketball August 21, 2025 Tech announces non-conference home schedule Basketball Schedule Buy Tickets Men's Basketball August 18, 2025 Tech, LSU to meet in Fort Worth Dickies Arena Men's Basketball August 06, 2025 Officially Signed: Jaylen Petty Follow Petty on Social Media Men's Basketball August 05, 2025 McCasland adds Gotcher to coaching staff Follow @TexasTechMBB  Load More  Find A Way - Episode 2 September 08, 2025 Find A Way - Episode 1 September 01, 2025  Load More   Lubbock, TX  TyereeBryan Senior Orlando, Florida JazzHenderson Redshirt Freshman Dallas, Texas LeJuanWatts Junior Fresno, California ChristianAnderson Sophomore Atlanta, Georgia JosiahMoseley Sophomore Round Rock, Texas LeonHorner Sophomore Dallas, Texas NolanGroves Freshman Long Lake, Minnesota LukeBamgboye Sophomore London, United Kingdom JackFrancis Senior Austin, Texas See Full Roster Men's Basketball Texas Tech vs. Florida - Elite Eight March 29, 2025 Men's Basketball Texas Tech vs. Arkansas - NCAA Sweet 16 March 27, 2025 Men's Basketball Texas Tech vs. Drake - NCAA Second Round March 22, 2025 Men's Basketball Texas Tech vs. UNCW - NCAA First Round March 20, 2025  Wreck Em  © 2025 Texas Tech University 2500 Broadway, Lubbock, Texas 79409",
      "url": "https://texastech.com/sports/mens-basketball"
    }
  ],
  "Organization": [
    {
      "title": " - TechConnect",
      "text": "",
      "url": "https://ttu.campuslabs.com/engage/"
    },
    {
      "title": " - TechConnect",
      "text": "",
      "url": "https://ttu.campuslabs.com/engage/organizations"
    },
    {
      "title": " - TechConnect",
      "text": "",
      "url": "https://ttu.campuslabs.com/engage/events"
    }
  ],
  "Volunteering": [
    {
      "title": "Volunteering | Volunteer Opportunities | PPHC  | TTU",
      "text": " Pre-Professional Health Careers  An important aspect of an applicant's resume and application is their volunteer experience.\n                        Health professions schools and programs review many applications each year and altruistic\n                        contributions to society are an important factor in the application process. Volunteering\n                        your time not only can help your application stand out from the others, but it can\n                        also teach valuable life skills that help in any profession or career. It is common for students to give back in their communities in their roles as members\n                        of student organizations, but whether you go that route or additional service is a\n                        goal of yours, there are many places in the Lubbock area where students can volunteer. Below are some organizations that provide volunteer opportunities to Texas Tech University\n                        students. To use the map below, begin by opening the content table with the arrow\n                        button in the top-left corner of the map. This will allow you to toggle between the\n                        various types of organizations (Healthcare, Community/Faith, and Interest/Hobbies).\n                        If an update is needed to any of the information listed below please let us know.   The opportunities and organizations listed in the menu below are not reflected in\n                        the map above. Use your compassion and talents to make a difference. Help to prevent kidney and urinary tract diseases. Occasional secretarial duties and sign language interpreting; volunteers provide services\n                                    for the deaf. Providing free tutoring to students K-12. Mentor 5th grade boys and girls. Provide sexual assault & abuse victims with free assistance; promote public awareness. Create an environment of empowerment for women, children and families, to eliminate\n                                    family violence. The Buddy Holly Hall has volunteer opportunities available. Creating, stuffing, and mailing Christmas Stockings to our overseas military bases. Creating experiences that entertain, inspire, and empower.  ",
      "url": "https://www.depts.ttu.edu/pphc/programs/Volunteering.php"
    }
  ],
  "Jobs": [
    {
      "title": "Work at Texas Tech | Human Resources Home  | TTU",
      "text": " Work at Texas Tech     With a career at Texas Tech University, you are limited only by your own ambition.\n                        We foster an environment of success, both for our students and our employees. When\n                        you work here, you become part of our campus community that's dedicated to advancing\n                        each other personally and professionally. Delve into our culture and learn the many benefits of working at Texas Tech by clicking\n                        the 'Why Texas Tech' link above. See first-hand what it's like working for this great\n                        university when you meet our team. Then find the position here that's just waiting for you. Welcome to your new career at Texas Tech University.\n                        Texas Tech is a great place to work. If you are unable or limited in your ability to use or access the application system\n                        due to a disability, limited English proficiency, or other reasons you may contact\n                        Human Resources at 806-742-3851, e-mail hrs.recruiting@ttu.edu or visit our office in the Texas Tech University Doak Conference Center, 2518 15th\n                        Street (15th & University), Lubbock, Texas, for assistance. Recommendations for screen\n                        readers, such as JAWS & Rational Policy Tester, are to use Mozilla Firefox web browser. Texas Tech University System will not discriminate in its employment practices because\n                        of an applicant's race, color, religion, sex, sexual orientation, gender identity,\n                        national origin, age, disability, genetic information, status as a protected veteran,\n                        or any other legally protected category, class or characteristic. The Office of Equal\n                        Opportunity upholds each institution's anti-discrimination and anti-retaliation policies\n                        and ensures that employees and applicants of the Texas Tech University System are\n                        treated fairly, equally, and respectfully. For additional information, please contact\n                        the Office of Equal Opportunity by calling 806-742-3627 or visiting the Office of\n                        Equal Opportunity website at www.texastech.edu/offices/equal-employment/.",
      "url": "https://www.depts.ttu.edu/hr/workattexastech/"
    },
    {
      "title": "Join the Hospitality Services Team! | Hospitality Services  | TTU",
      "text": " Hospitality Services   APPLY NOWDownload an application and submit by E-mailing it to dee.nguyen@ttu.edu orDropping it by Hospitality Services office in the Wiggins Complex  Join our team of Red Raiders feeding Red Raiders! You’ll have an opportunity to prepare,\n                        cook, and serve food while maintaining a clean working environment in one of our 25\n                        Dining Locations across campus. Thrive in a fast-paced, supportive environment, gaining\n                        skills that help you become a leader in your career, no matter where you go! No experience\n                        needed, we’ll train you! There are even opportunities to bartend and support Top Tier\n                        Catering. No matter what kind of atmosphere you want to work in – Hospitality Services\n                        has just the position for you! For a list of current full-time employment opportunities, visit Work @ TTU",
      "url": "https://www.depts.ttu.edu/hospitality/jobs.php"
    },
    {
      "title": "Work for Housing | Housing  | TTU",
      "text": " University Student Housing    \n                        University Student Housing is here to serve our students and our team.\n                        We look for professionals with a passion for excellence who believe in\n                        the power of teamwork, civility, and leadership. Together, we maintain\n                        over two million square feet and serve a community of over 8,000\n                        students within our Residence Halls. As one of the largest employers on\n                        campus, our department offers the stability, success, and values you can\n                        be proud to represent as a professional and a Red Raider. Whether you\n                        are a student, an experienced professional, or just starting your\n                        career, University Student Housing offers an array of opportunities that\n                        are right for you!\n                         \nResponsible for the performance of manual work involving the cleaning and care of\n                                 buildings.\n                              \t\t\t  (\n                                 Apply to Requisition 41773BR )\n                              \n                               Responsible for the performance of manual work involving the cleaning and care of\n                                 buildings. \n                              \t\t\t  (\n                                 Apply to Requisition 41607BR )\n                              \t\t\t  \n                              \n                              \n                                 Oversees academic and leadership development within Residence Life, focusing on supervision,\n                                 administration, student development, and emergency response. \n\n                                 Note: All positions are considered a part of the larger team. In the event of a vacancy,\n                                 staff may be asked to fulfill a role or have other job duties added to their position\n                                 to meet the needs of staff and the department. Every effort will be made to recruit\n                                 and fill positions as quickly as possible to allow staff to return to the duties for\n                                 which they were originally hired.\n \n                                 Oversees academic and leadership development within Residence Life, focusing on supervision,\n                                 administration, student development, and emergency response.  \n                                 Note: All positions are considered a part of the larger team. In the event of a vacancy,\n                                 staff may be asked to fulfill a role or have other job duties added to their position\n                                 to meet the needs of staff and the department. Every effort will be made to recruit\n                                 and fill positions as quickly as possible to allow staff to return to the duties for\n                                 which they were originally hired. \n                              \t\t\t  (\n                                 Apply to Requisition 41692BR )\n                              \t\t\t  \n                              \n                              \n                                 Provides student support through crisis response, case management, and coordination\n                                 of services to address academic, personal, or medical challenges. \n \n                                 Provides student support through crisis response, case management, and coordination\n                                 of services to address academic, personal, or medical challenges.  \n                              \t\t\t  (\n                                 Apply to Requisition 41693BR )\n                              \t\t\t  \n                              \n                              \n                                 Residence Life Coordinator staff with University Student Housing serve students by\n                                 performing responsibilities in supervision, advising, administration, crisis response,\n                                 and summer operations. Residence Life Coordinator staff are responsible for the building\n                                 management and direct oversight of an assigned residential complex(s). These team\n                                 members supervisor a full-time Senior Business Assistant, 1-2 Graduate Hall Coordinators,\n                                 6-23 Community Advisors and up to 12 Student Assistants. This position serves in an\n                                 on-call rotation. \n \n                                 Residence Life Coordinator staff with University Student Housing serve students by\n                                 performing responsibilities in supervision, advising, administration, crisis response,\n                                 and summer operations. Residence Life Coordinator staff are responsible for the building\n                                 management and direct oversight of an assigned residential complex(s). These team\n                                 members supervisor a full-time Senior Business Assistant, 1-2 Graduate Hall Coordinators,\n                                 6-23 Community Advisors and up to 12 Student Assistants. This position serves in an\n                                 on-call rotation.  \n                              \t\t\t  (\n                                 Apply to Requisition 40105BR )\n                              \t\t\t  \n                              \n                              \n                                 Safely performs journeyperson level tasks in the fabrication, construction, maintenance,\n                                 alteration and repair of fixtures, equipment, structures, buildings, and built-in\n                                 components for Texas Tech University Student Housing. \n \n                                 Safely performs journeyperson level tasks in the fabrication, construction, maintenance,\n                                 alteration and repair of fixtures, equipment, structures, buildings, and built-in\n                                 components for Texas Tech University Student Housing.  \n                              \t\t\t  (\n                                 Apply to Requisition 41255BR )\n                              \t\t\t  \n                              \n                              \n                                 Responsible for performing carpentry, electrical, and plumbing repairs; completing\n                                 work orders efficiently; supporting summer restoration projects; and conducting daily\n                                 inspections to ensure the safety and integrity of assigned buildings. \n \n                                 Responsible for performing carpentry, electrical, and plumbing repairs; completing\n                                 work orders efficiently; supporting summer restoration projects; and conducting daily\n                                 inspections to ensure the safety and integrity of assigned buildings.  \n                              \t\t\t  (\n                                 Apply to Requisition 41256BR )\n                              \t\t\t  \n                              \n                              \n                                 Responsible for performing skilled carpentry work, including framing, drywall, and\n                                 working with various wood materials. This role involves preparing project materials,\n                                 maintaining accurate records, ensuring precision with minimal waste, and upholding\n                                 safety and quality standards. \n \n                                 Responsible for performing skilled carpentry work, including framing, drywall, and\n                                 working with various wood materials. This role involves preparing project materials,\n                                 maintaining accurate records, ensuring precision with minimal waste, and upholding\n                                 safety and quality standards.  \n                              \t\t\t  (\n                                 Apply to Requisition 41703BR )\n                              \t\t\t  \n                              \n                              \n                                 Oversees environmental response and protocol compliance, including mold investigations\n                                 and coordination with Environmental Health and Safety. This role ensures quality assurance\n                                 on maintenance and construction projects, manages project timelines, and facilitates\n                                 effective communication with contractors and campus partners to support smooth service\n                                 delivery. \n \n                                 Oversees environmental response and protocol compliance, including mold investigations\n                                 and coordination with Environmental Health and Safety. This role ensures quality assurance\n                                 on maintenance and construction projects, manages project timelines, and facilitates\n                                 effective communication with contractors and campus partners to support smooth service\n                                 delivery.  \n                              \n                              (\n                                 Apply to Requisition 40722BR )\n                              \n                              \n                              \n                                 Provide front-line customer service by greeting guests, answering housing inquiries,\n                                 giving residence hall tours, and supporting office tasks such as phone calls, emails,\n                                 and document handling—all to assist prospective students and their families. \n                                 \n \n                                 Provide front-line customer service by greeting guests, answering housing inquiries,\n                                 giving residence hall tours, and supporting office tasks such as phone calls, emails,\n                                 and document handling—all to assist prospective students and their families. \n                                  \n                              \n                              (\n                                 Apply to Requisition 42104BR )\n                              \n                              \n                              \n                                 Deliver customer service in person, by phone, and online. Handle mail, keys, and reports.\n                                 Use departmental systems to support operations. Assist in emergency response with\n                                 campus staff. Support housing programs, campus events, and refer students to campus\n                                 resources.\n                                 \n \n                                 Deliver customer service in person, by phone, and online. Handle mail, keys, and reports.\n                                 Use departmental systems to support operations. Assist in emergency response with\n                                 campus staff. Support housing programs, campus events, and refer students to campus\n                                 resources.\n                                  \n                              \n                              (\n                                 Apply to Requisition 42095BR )\n                              \n                              \n                              \n                                 Build community through programming, resident engagement, and conflict mediation.\n                                 Support academic and personal development by promoting campus resources and events.\n                                 Respond to student concerns and emergencies during on-call shifts. Maintain administrative\n                                 duties including reports, budget proposals, and use of departmental systems. Collaborate\n                                 with campus partners and support departmental initiatives and leadership programs.\n                                 \n \n                                 Build community through programming, resident engagement, and conflict mediation.\n                                 Support academic and personal development by promoting campus resources and events.\n                                 Respond to student concerns and emergencies during on-call shifts. Maintain administrative\n                                 duties including reports, budget proposals, and use of departmental systems. Collaborate\n                                 with campus partners and support departmental initiatives and leadership programs.\n                                  \n\n\n                                 Administration and Business Services - Student Ambassadors\n                                 \n\n\n                                    Housing Ambassador staff work in the University Student\n                                    Housing Welcome Center and provide excellent customer service\n                                    to students, parents, and guests in-person, via phone, email,\n                                    and chat. Housing Ambassadors assist in university and\n                                    department recruitment efforts by hosting residence hall tours\n                                    and serving as a resource to students and staff. Housing\n                                    Ambassadors receive $10.25/Hour and are offered up to 20 hours\n                                    of work per week.\n                                    \n\n\n\n\n\n                                 Administration and Business Services - Marketing Student\n                                 Assistant\n                                 \n\n\n                                    Marketing Student Assistant staff perform creative and\n                                    administrative duties within the Marketing area as assigned.\n                                    Duties include, but are not limited to, taking, and editing\n                                    professional photos and developing graphic design for use on\n                                    social media, the department website and various department\n                                    marketing campaigns. This position also assists in posting\n                                    important events and updates to department social media pages,\n                                    maintaining inventory of marketing give-a-way items, preparing\n                                    new employee onboarding bags and assisting with assigned\n                                    projects. Student Assistants receive $10.25/Hour and are\n                                    offered up to 20 hours of work per week.\n                                    \n\n\n\n\n\n                                 Administration and Business Services - Marketing Student\n                                 Videographer\n                                 \n\n\n                                    Student Videographers plan, create and edit video content for\n                                    social media, the department website and various department\n                                    marketing campaigns. This position works closely with\n                                    department professional staff and assists with taking and\n                                    editing professional photos, posting important events and\n                                    updates to department social media pages, maintaining\n                                    inventory of marketing give-a-way items, preparing new\n                                    employee onboarding bags and assisting with assigned projects.\n                                    Student Assistants receive $10.25/Hour and are offered up to\n                                    20 hours of work per week.\n                                    \n\n\n\n\n\n                                 Facilities - Interior Design Student Assistants\n                                 \n\n\n                                    Interior Design Student Assistant will work on CAD drawings,\n                                    select finishes, and make sample boards. They will work on\n                                    various remodeling projects, attend progress meetings, and\n                                    keep a digital record of each one. They will work with each\n                                    trade we have here at housing; carpenters, painters,\n                                    upholstery, etc. They will help decorate showrooms, supervise\n                                    installations, inventory furniture, and attend weekly project\n                                    meetings. They will help maintain the library and meet with\n                                    various manufacturer rep's. They will shadow the licensed Sr.\n                                    designers daily.\n                                    \n\n\n\n\n\n                                 Facilities - Trades Student Assistants\n                                 \n\n\n                                    Trades Student Assistants work with one specific trade area,\n                                    typically Paint, Electric, HVAC, Carpentry, Plumbing, or\n                                    Maintenance. They assist with work orders, preventative\n                                    maintenance, projects, and customer service while learning\n                                    more about the designated trade.\n                                    \n\n\n\n\n\n                                 Facilities - Facilities Coordinator Student Assistants\n                                 \n\n\n                                    Facilities-Facilities Coordinator Student Assistants\n                                    Facilities Coordinator Student Assistants are responsible for\n                                    assisting the Facility Coordinator team with overnight\n                                    building maintenance, safety checks, reporting, and customer\n                                    service. They work independently to ensure that our residence\n                                    halls are operating as they should overnight while helping\n                                    students with any issues that may arise.\n                                    \n\n\n\n\n\n                                 Facilities - Front Office Student Assistants\n                                 \n\n\n                                    Front Office Student Assistants work in our Housing Services\n                                    main office to assist with work control, customer service, and\n                                    general office duties, such as scanning, copying, entering and\n                                    processing work orders, and other roles as needed.\n                                    Additionally, they assist with all facilities internal\n                                    marketing, including staff appreciation days, recognition,\n                                    team photography, and more.\n                                    \n\n\n\n\n\n                                 Residence Life - Community Advisor\n                                 \n\n\n                                    Community Advisor staff work within the residence halls and\n                                    are responsible for establishing a community environment that\n                                    is focused on student learning and student success. To\n                                    accomplish this, the Community Advisor is expected to play a\n                                    variety of roles. Community Advisors must be flexible and\n                                    creative in their role as an educator, advisor, mentor, and\n                                    educational programmer to meet the needs of their residents.\n                                    This position requires a substantial time commitment and the\n                                    ability to be available and accessible to the members of their\n                                    community. Community Advisors receive compensation in the form\n                                    of housing, a meal plan, and a monthly stipend.\n                                    \n                                    Learn more about our Residence Life student staff\n                                    opportunities here.\n                                    \n\n\n\n\n\n                                 Residence Life - Student Assistant\n                                 \n\n\n                                    Residence Life Student Assistant staff have primary\n                                    responsibilities in providing customer service to University\n                                    Student Housing residents, guests, parents, families, and\n                                    University faculty, staff, and other officials. The SA\n                                    provides administrative support through the 24-hour service\n                                    desk and assists in maintaining the safety and security of the\n                                    residence hall facilities. The Student Assistant work schedule\n                                    will vary to maintain the 24-hour desk operation. Student\n                                    Assistants will be required to work a minimum of one\n                                    three-hour shift per week between the hours of 12:00am –\n                                    9:00am. Student Assistants receive $10.25/Hour and are offered\n                                    up to 20 hours of work per week.\n                                    \n                                    Learn more about our Residence Life student staff\n                                    opportunities here.\n                                    \n\n\n\n\n\n                                 Residence Life - Summer Community Advisor\n                                 \n\n\n                                    Summer Community Advisor staff live in the residence halls and\n                                    have primary responsibilities in community building,\n                                    administration, on-call/crisis response, and departmental and\n                                    campus support. Summer Community Advisors are responsible for\n                                    establishing a community environment that is focused on\n                                    student learning and student success. To accomplish this,\n                                    Summer Community Advisors are expected to play a variety of\n                                    roles. The Summer Community Advisor must be flexible and\n                                    creative in their role as an educator, advisor, mentor, and\n                                    educational programmer to meet the needs of their residents.\n                                    This position requires a substantial time commitment and the\n                                    ability to be available and accessible to the members of their\n                                    community. This position is typically employed late May\n                                    through early August. Summer Community Advisors receive\n                                    compensation in the form of housing, a meal plan, and a\n                                    monthly stipend.\n                                    \n                                    Learn more about our Residence Life student staff\n                                    opportunities here.\n                                    \n\n\n\n\n\n                                 Residence Life - Summer Conference Staff\n                                 \n\n\n                                    Summer Conference Staff live in the residence halls and assist\n                                    in the daily management and operation of a Residence\n                                    Hall/Complex during the summer conference season. As a member\n                                    of the Residence Life staff, the Conference Staff work\n                                    professional staff and interns in creating a positive\n                                    environment for all campus guests. Many times, the Conference\n                                    Staff is the first contact individuals experience in the\n                                    residence halls and at Texas Tech University. This position is\n                                    typically employed late May through early August. Summer\n                                    Conference staff receive compensation in the form of housing,\n                                    a meal plan, and a monthly stipend.\n                                    \n                                    Learn more about our Residence Life student staff\n                                    opportunities here.\n                                    \n\n\n\n\n\n                                 Residence Life - Summer Guest Services Specialist\n                                 \n\n\n                                    Summer Guest Services Specialist staff assist in the daily\n                                    management and operation of a Residence Hall/Complex during\n                                    the summer conference season. As a member of the Residence\n                                    Life staff, the Guest Services Specialist works with\n                                    professional staff and interns in creating a positive\n                                    environment for all campus guests. Weekly work will include\n                                    desk coverage at conference residence halls, weekly meetings,\n                                    housekeeping assistance, building preparation, and other\n                                    summer operational tasks. Many times, the Guest Services\n                                    Specialist is the first contact individuals experience in the\n                                    residence halls and at Texas Tech University. This position is\n                                    typically employed late May through early August. Guest\n                                    Services Specialists receive $10.00/Hour and are offered up to\n                                    20 hours of work per week.\n                                    \n                                    Learn more about our Residence Life student staff\n                                    opportunities here.\n                                    \n\n\n \n                                    Housing Ambassador staff work in the University Student\n                                    Housing Welcome Center and provide excellent customer service\n                                    to students, parents, and guests in-person, via phone, email,\n                                    and chat. Housing Ambassadors assist in university and\n                                    department recruitment efforts by hosting residence hall tours\n                                    and serving as a resource to students and staff. Housing\n                                    Ambassadors receive $10.25/Hour and are offered up to 20 hours\n                                    of work per week.\n                                     \n                                    Marketing Student Assistant staff perform creative and\n                                    administrative duties within the Marketing area as assigned.\n                                    Duties include, but are not limited to, taking, and editing\n                                    professional photos and developing graphic design for use on\n                                    social media, the department website and various department\n                                    marketing campaigns. This position also assists in posting\n                                    important events and updates to department social media pages,\n                                    maintaining inventory of marketing give-a-way items, preparing\n                                    new employee onboarding bags and assisting with assigned\n                                    projects. Student Assistants receive $10.25/Hour and are\n                                    offered up to 20 hours of work per week.\n                                     \n                                    Student Videographers plan, create and edit video content for\n                                    social media, the department website and various department\n                                    marketing campaigns. This position works closely with\n                                    department professional staff and assists with taking and\n                                    editing professional photos, posting important events and\n                                    updates to department social media pages, maintaining\n                                    inventory of marketing give-a-way items, preparing new\n                                    employee onboarding bags and assisting with assigned projects.\n                                    Student Assistants receive $10.25/Hour and are offered up to\n                                    20 hours of work per week.\n                                     \n                                    Interior Design Student Assistant will work on CAD drawings,\n                                    select finishes, and make sample boards. They will work on\n                                    various remodeling projects, attend progress meetings, and\n                                    keep a digital record of each one. They will work with each\n                                    trade we have here at housing; carpenters, painters,\n                                    upholstery, etc. They will help decorate showrooms, supervise\n                                    installations, inventory furniture, and attend weekly project\n                                    meetings. They will help maintain the library and meet with\n                                    various manufacturer rep's. They will shadow the licensed Sr.\n                                    designers daily.\n                                     \n                                    Trades Student Assistants work with one specific trade area,\n                                    typically Paint, Electric, HVAC, Carpentry, Plumbing, or\n                                    Maintenance. They assist with work orders, preventative\n                                    maintenance, projects, and customer service while learning\n                                    more about the designated trade.\n                                     \n                                    Facilities-Facilities Coordinator Student Assistants\n                                    Facilities Coordinator Student Assistants are responsible for\n                                    assisting the Facility Coordinator team with overnight\n                                    building maintenance, safety checks, reporting, and customer\n                                    service. They work independently to ensure that our residence\n                                    halls are operating as they should overnight while helping\n                                    students with any issues that may arise.\n                                     \n                                    Front Office Student Assistants work in our Housing Services\n                                    main office to assist with work control, customer service, and\n                                    general office duties, such as scanning, copying, entering and\n                                    processing work orders, and other roles as needed.\n                                    Additionally, they assist with all facilities internal\n                                    marketing, including staff appreciation days, recognition,\n                                    team photography, and more.\n                                     \n                                    Community Advisor staff work within the residence halls and\n                                    are responsible for establishing a community environment that\n                                    is focused on student learning and student success. To\n                                    accomplish this, the Community Advisor is expected to play a\n                                    variety of roles. Community Advisors must be flexible and\n                                    creative in their role as an educator, advisor, mentor, and\n                                    educational programmer to meet the needs of their residents.\n                                    This position requires a substantial time commitment and the\n                                    ability to be available and accessible to the members of their\n                                    community. Community Advisors receive compensation in the form\n                                    of housing, a meal plan, and a monthly stipend.\n                                    \n                                    Learn more about our Residence Life student staff\n                                    opportunities here.\n                                     \n                                    Residence Life Student Assistant staff have primary\n                                    responsibilities in providing customer service to University\n                                    Student Housing residents, guests, parents, families, and\n                                    University faculty, staff, and other officials. The SA\n                                    provides administrative support through the 24-hour service\n                                    desk and assists in maintaining the safety and security of the\n                                    residence hall facilities. The Student Assistant work schedule\n                                    will vary to maintain the 24-hour desk operation. Student\n                                    Assistants will be required to work a minimum of one\n                                    three-hour shift per week between the hours of 12:00am –\n                                    9:00am. Student Assistants receive $10.25/Hour and are offered\n                                    up to 20 hours of work per week.\n                                    \n                                    Learn more about our Residence Life student staff\n                                    opportunities here.\n                                     \n                                    Summer Community Advisor staff live in the residence halls and\n                                    have primary responsibilities in community building,\n                                    administration, on-call/crisis response, and departmental and\n                                    campus support. Summer Community Advisors are responsible for\n                                    establishing a community environment that is focused on\n                                    student learning and student success. To accomplish this,\n                                    Summer Community Advisors are expected to play a variety of\n                                    roles. The Summer Community Advisor must be flexible and\n                                    creative in their role as an educator, advisor, mentor, and\n                                    educational programmer to meet the needs of their residents.\n                                    This position requires a substantial time commitment and the\n                                    ability to be available and accessible to the members of their\n                                    community. This position is typically employed late May\n                                    through early August. Summer Community Advisors receive\n                                    compensation in the form of housing, a meal plan, and a\n                                    monthly stipend.\n                                    \n                                    Learn more about our Residence Life student staff\n                                    opportunities here.\n                                     \n                                    Summer Conference Staff live in the residence halls and assist\n                                    in the daily management and operation of a Residence\n                                    Hall/Complex during the summer conference season. As a member\n                                    of the Residence Life staff, the Conference Staff work\n                                    professional staff and interns in creating a positive\n                                    environment for all campus guests. Many times, the Conference\n                                    Staff is the first contact individuals experience in the\n                                    residence halls and at Texas Tech University. This position is\n                                    typically employed late May through early August. Summer\n                                    Conference staff receive compensation in the form of housing,\n                                    a meal plan, and a monthly stipend.\n                                    \n                                    Learn more about our Residence Life student staff\n                                    opportunities here.\n                                     \n                                    Summer Guest Services Specialist staff assist in the daily\n                                    management and operation of a Residence Hall/Complex during\n                                    the summer conference season. As a member of the Residence\n                                    Life staff, the Guest Services Specialist works with\n                                    professional staff and interns in creating a positive\n                                    environment for all campus guests. Weekly work will include\n                                    desk coverage at conference residence halls, weekly meetings,\n                                    housekeeping assistance, building preparation, and other\n                                    summer operational tasks. Many times, the Guest Services\n                                    Specialist is the first contact individuals experience in the\n                                    residence halls and at Texas Tech University. This position is\n                                    typically employed late May through early August. Guest\n                                    Services Specialists receive $10.00/Hour and are offered up to\n                                    20 hours of work per week.\n                                    \n                                    Learn more about our Residence Life student staff\n                                    opportunities here.\n                                     \n\n\n                                    Graduate Hall Coordinator\n                                    \n\n\n                                       We accept applications through both the Oskhosh Placement Exchange and through independent\n                                       searchers. Those participating in the Oshkosh Placement Exchange may contact us through\n                                       the OPE site. For independent searchers, please submit your resume, cover letter,\n                                       and the names and contact information of three professional references to housing.rl.jobs@ttu.edu.\n                                       \n\n                                       The Graduate Hall Coordinator has primary responsibilities in supervision, administration,\n                                       on-call crisis response, building management, and advising. Graduate Hall Coordinators\n                                       are members of the Residence Life Professional Staff team and are supervised by a\n                                       Residence Life Coordinator. The Graduate Hall Coordinator position assists in the\n                                       recruitment, training, and supervision of assigned paraprofessional staff. This position\n                                       also helps in the management and implementation of the Residential Curriculum, completing\n                                       student-of-concern reports, collaborating with internal and external stakeholders,\n                                       and promoting community development. This position also advises or co-advises student\n                                       organizations as assigned and works to track and maintain complex council account\n                                       ledgers.\n                                       \nGraduate Hall Coordinators work 30 hours per week—typical work hours between 10 a.m.\n                                       to 4 p.m., Monday through Friday. Individuals unable to fulfill the 30-hour-per-week\n                                       requirement are ineligible for the Graduate Hall Coordinator position.\n\n\n \n                                       We accept applications through both the Oskhosh Placement Exchange and through independent\n                                       searchers. Those participating in the Oshkosh Placement Exchange may contact us through\n                                       the OPE site. For independent searchers, please submit your resume, cover letter,\n                                       and the names and contact information of three professional references to housing.rl.jobs@ttu.edu.\n                                        \n                                       The Graduate Hall Coordinator has primary responsibilities in supervision, administration,\n                                       on-call crisis response, building management, and advising. Graduate Hall Coordinators\n                                       are members of the Residence Life Professional Staff team and are supervised by a\n                                       Residence Life Coordinator. The Graduate Hall Coordinator position assists in the\n                                       recruitment, training, and supervision of assigned paraprofessional staff. This position\n                                       also helps in the management and implementation of the Residential Curriculum, completing\n                                       student-of-concern reports, collaborating with internal and external stakeholders,\n                                       and promoting community development. This position also advises or co-advises student\n                                       organizations as assigned and works to track and maintain complex council account\n                                       ledgers.\n                                        Graduate Hall Coordinators work 30 hours per week—typical work hours between 10 a.m.\n                                       to 4 p.m., Monday through Friday. Individuals unable to fulfill the 30-hour-per-week\n                                       requirement are ineligible for the Graduate Hall Coordinator position. \n\n\n                                    Academic Initiatives Internship\n                                    \n\n\n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Academic Initiatives Intern is supervised by the Manager\n                                       of Academic Initiatives. Projects may include develop a\n                                       marketing plan for Residential Tutoring; research, propose,\n                                       and develop a learning community stakeholder recognition\n                                       program, assist with training, hiring, and planning fall\n                                       training for Residential Tutors, plan faculty/staff move-in\n                                       volunteers initiative, review and analyze Residential Tutoring\n                                       data, and review and analyze Learning Community data. The\n                                       intern will attend departmental staff meetings and may have\n                                       the opportunity to attend other meetings as available.\n                                       Additionally, the intern may serve on departmental committees,\n                                       task forces, or assist with collateral assignments to create\n                                       and implement intentional experiences that support the\n                                       department and university mission (assigned by supervisory\n                                       personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                       \n\n\n\n\n\n                                    Conference Services Internship\n                                    \n\n\n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       Conference Services Interns are supervised by the Manager for\n                                       Conference Services. Projects may include assisting with camp\n                                       and conference check-ins and check-outs, facilitating client\n                                       meetings, conference guest room assignments, cross-training\n                                       and working with housekeeping for building turnovers,\n                                       coordinating final details for camps and conferences with\n                                       clients, creating signage, providing direct or indirect\n                                       supervision of student paraprofessionals, which may include\n                                       Student Conference Staff, and assisting the Manager for\n                                       Conference Services. The Intern may also work with student\n                                       orientation, thereby having the opportunity to meet and talk\n                                       with partners and departments from all areas of the\n                                       University. The Intern will also be responsible for ongoing\n                                       student paraprofessional recognition including the end of\n                                       summer recognition event. The intern will attend departmental\n                                       staff meetings and may have the opportunity to attend other\n                                       meetings as available. Additionally, the intern may serve on\n                                       departmental committees, task forces, or assist with\n                                       collateral assignments to create and implement intentional\n                                       experiences that support the department and university mission\n                                       (assigned by supervisory personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                       \n\n\n\n\n\n                                    Housing Facilities Internship\n                                    \n\n\n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Housing Facilities Intern is supervised by the Manager of\n                                       Facilities Services. The Housing Facilities Intern will assist\n                                       with Housing Facilities Projects. These projects may include\n                                       learning to interpret blueprints and contract specifications\n                                       for renovations, coordinating between Residence Life and\n                                       Facilities for utility shutdowns, representing Facilities in\n                                       the Conference Stakeholders Meetings, working with\n                                       Sustainability initiatives and utility usage/billing analysis;\n                                       research and analysis of the work order system; assisting with\n                                       interpreting and communication of assessments; and assisting\n                                       with project development. The Housing Facilities Intern may\n                                       also work in the Housing Facilities office on other projects.\n                                       The Housing Facilities Intern is expected to work with the\n                                       facilities management team in maintenance, renovation,\n                                       housekeeping and interior design, purchasing/inventory,\n                                       sustainability and other departmental staff in the development\n                                       and implementation of management and learning initiatives for\n                                       the entire housing facilities operation. The intern will\n                                       attend departmental staff meetings and may have the\n                                       opportunity to attend other meetings as available.\n                                       Additionally, the intern may serve on departmental committees,\n                                       task forces, or assist with collateral assignments to create\n                                       and implement intentional experiences that support the\n                                       department and university mission (assigned by supervisory\n                                       personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                       \n\n\n\n\n\n                                    Information Technology Internship\n                                    \n\n\n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Information Technology Intern is supervised by the Manager\n                                       of Information Technology. The Information Technology Intern\n                                       will assist with various tasks, ranging from web and software\n                                       development to support of vendor systems and hardware\n                                       workstation technologies. Job duties may include creating\n                                       documentation of existing software systems; modifying existing\n                                       solutions; helping to move, install, configure, remove, and\n                                       surplus hardware equipment; managing periodic announcements\n                                       about technology changes; writing or altering reports;\n                                       organizing data; and performing server maintenance and\n                                       support. The intern will attend departmental staff meetings\n                                       and may have the opportunity to attend other meetings as\n                                       available. Additionally, the intern may serve on departmental\n                                       committees, task forces, or assist with collateral assignments\n                                       to create and implement intentional experiences that support\n                                       the department and university mission (assigned by supervisory\n                                       personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                       \n\n\n\n\n\n                                    Marketing and Communications Internship\n                                    \n\n\n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Marketing and Communications Intern is supervised by the\n                                       Manager of Marketing and Communications. The Marketing and\n                                       Communications will assist with various summer assignments,\n                                       including summer conferences, and New Student Orientation. Job\n                                       duties may include assisting the Manager of Marketing and\n                                       Communication for University Student Housing marketing\n                                       efforts; websites; press releases; newsletters; publications;\n                                       other communications; and special events. The Intern will also\n                                       oversee development and implementation of the University\n                                       Student Housing brand and department adherence to the Texas\n                                       Tech University branding guidelines. The University Student\n                                       Housing Marketing and Communications Intern will also assist\n                                       with strategic marketing and public relations campaigns. The\n                                       University Student Housing Marketing and Communications Intern\n                                       must have the ability to work with a diverse public: faculty,\n                                       staff, and campus/community partners. The intern will attend\n                                       departmental staff meetings and may have the opportunity to\n                                       attend other meetings as available. Additionally, the intern\n                                       may serve on departmental committees, task forces, or assist\n                                       with collateral assignments to create and implement\n                                       intentional experiences that support the department and\n                                       university mission (assigned by supervisory personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                       \n\n\n\n\n\n                                    Recruitment and Training Internship\n                                    \n\n\n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Recruitment and Training Intern is supervised by the\n                                       Associate Director of Student Staff Recruitment and Training.\n                                       Projects may include assisting with the recruitment and\n                                       training of student and professional staff; assisting with the\n                                       development and communication of assessments; assisting with\n                                       development of academic year development series for student\n                                       and professional staff; and assisting with the development of\n                                       campus and community partnerships. This job will also assist\n                                       in researching best practices in training and recruitment. The\n                                       intern will attend departmental staff meetings and may have\n                                       the opportunity to attend other meetings as available.\n                                       Additionally, the intern may serve on departmental committees,\n                                       task forces, or assist with collateral assignments to create\n                                       and implement intentional experiences that support the\n                                       department and university mission (assigned by supervisory\n                                       personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                       \n\n\n\n\n\n                                    Student Leadership Internship\n                                    \n\n\n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Student Leadership Intern is supervised by the Assistant\n                                       Director for Student Leadership Development. While direct\n                                       contact with student leaders will be somewhat limited, the\n                                       intern will work on significant projects that directly and\n                                       significantly benefit Texas Tech students. Projects may\n                                       include assisting in the development of Service Week, creation\n                                       of complex council election advertisements and materials,\n                                       assisting with the development of the annual Complex Council\n                                       retreat, assisting with the Howdy TECHsan early move-in\n                                       leadership program, fall traditional event preparation, social\n                                       justice benchmarking and compilation of area assessment data,\n                                       and updating and creating materials for Alternative Spring\n                                       Break leaders. The intern will attend departmental staff\n                                       meetings and may have the opportunity to attend other meetings\n                                       as available. Additionally, the intern may serve on\n                                       departmental committees, task forces, or assist with\n                                       collateral assignments to create and implement intentional\n                                       experiences that support the department and university mission\n                                       (assigned by supervisory personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                       \n\n\n\n\n\n                                    Summer School Internship\n                                    \n\n\n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Summer School Intern is supervised by the Residence Life\n                                       Coordinator(s) for Summer School Operations. Projects may\n                                       include assisting with residence hall transition from Spring\n                                       to Summer, Summer Session I to Summer Session II, and Summer\n                                       Session II to Fall; assisting in training, supervision, and\n                                       evaluation of 6-17 summer Community Advisors; facilitating\n                                       weekly meetings with student staff; assisting with the\n                                       execution of the Residential Curriculum; serving in an on-call\n                                       rotation and assisting with oversight and scheduling of front\n                                       desk operations. The intern will attend departmental staff\n                                       meetings and may have the opportunity to attend other meetings\n                                       as available. Additionally, the intern may serve on\n                                       departmental committees, task forces, or assist with\n                                       collateral assignments to create and implement intentional\n                                       experiences that support the department and university mission\n                                       (assigned by supervisory personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                       \n\n\n\n\n\n                                    Welcome Center Internship\n                                    \n\n\n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Welcome Center Intern is supervised by the Manager of the\n                                       Welcome Center. The Welcome Center Intern will assist with\n                                       various summer assignments, including summer conferences, and\n                                       New Student Orientation. Job duties may include assisting with\n                                       check-ins and check-outs; assisting with presentations;\n                                       assisting with setting-up and hosting of information tables;\n                                       room assignments; creating signage; direct or indirect\n                                       supervision of student paraprofessionals; and assisting the\n                                       Manager – Welcome Center. The Welcome Center Intern may also\n                                       work with student/parent orientation, thereby having the\n                                       opportunity to meet and talk with partners and departments\n                                       from all areas of the university. The Welcome Center Intern is\n                                       a vital member of the residence hall community and the\n                                       University Student Housing Staff. The intern is expected to\n                                       work with the Associate Director for Client Relations,\n                                       Marketing, and Information Technology; Manager – Welcome\n                                       Center; Housing Advisors, Student Ambassadors; Student Housing\n                                       Coordinators; and visiting guests. The intern will attend\n                                       departmental staff meetings and may have the opportunity to\n                                       attend other meetings as available. Additionally, the intern\n                                       may serve on departmental committees, task forces, or assist\n                                       with collateral assignments to create and implement\n                                       intentional experiences that support the department and\n                                       university mission (assigned by supervisory personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                       \n\n\n \n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Academic Initiatives Intern is supervised by the Manager\n                                       of Academic Initiatives. Projects may include develop a\n                                       marketing plan for Residential Tutoring; research, propose,\n                                       and develop a learning community stakeholder recognition\n                                       program, assist with training, hiring, and planning fall\n                                       training for Residential Tutors, plan faculty/staff move-in\n                                       volunteers initiative, review and analyze Residential Tutoring\n                                       data, and review and analyze Learning Community data. The\n                                       intern will attend departmental staff meetings and may have\n                                       the opportunity to attend other meetings as available.\n                                       Additionally, the intern may serve on departmental committees,\n                                       task forces, or assist with collateral assignments to create\n                                       and implement intentional experiences that support the\n                                       department and university mission (assigned by supervisory\n                                       personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                        \n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       Conference Services Interns are supervised by the Manager for\n                                       Conference Services. Projects may include assisting with camp\n                                       and conference check-ins and check-outs, facilitating client\n                                       meetings, conference guest room assignments, cross-training\n                                       and working with housekeeping for building turnovers,\n                                       coordinating final details for camps and conferences with\n                                       clients, creating signage, providing direct or indirect\n                                       supervision of student paraprofessionals, which may include\n                                       Student Conference Staff, and assisting the Manager for\n                                       Conference Services. The Intern may also work with student\n                                       orientation, thereby having the opportunity to meet and talk\n                                       with partners and departments from all areas of the\n                                       University. The Intern will also be responsible for ongoing\n                                       student paraprofessional recognition including the end of\n                                       summer recognition event. The intern will attend departmental\n                                       staff meetings and may have the opportunity to attend other\n                                       meetings as available. Additionally, the intern may serve on\n                                       departmental committees, task forces, or assist with\n                                       collateral assignments to create and implement intentional\n                                       experiences that support the department and university mission\n                                       (assigned by supervisory personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                        \n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Housing Facilities Intern is supervised by the Manager of\n                                       Facilities Services. The Housing Facilities Intern will assist\n                                       with Housing Facilities Projects. These projects may include\n                                       learning to interpret blueprints and contract specifications\n                                       for renovations, coordinating between Residence Life and\n                                       Facilities for utility shutdowns, representing Facilities in\n                                       the Conference Stakeholders Meetings, working with\n                                       Sustainability initiatives and utility usage/billing analysis;\n                                       research and analysis of the work order system; assisting with\n                                       interpreting and communication of assessments; and assisting\n                                       with project development. The Housing Facilities Intern may\n                                       also work in the Housing Facilities office on other projects.\n                                       The Housing Facilities Intern is expected to work with the\n                                       facilities management team in maintenance, renovation,\n                                       housekeeping and interior design, purchasing/inventory,\n                                       sustainability and other departmental staff in the development\n                                       and implementation of management and learning initiatives for\n                                       the entire housing facilities operation. The intern will\n                                       attend departmental staff meetings and may have the\n                                       opportunity to attend other meetings as available.\n                                       Additionally, the intern may serve on departmental committees,\n                                       task forces, or assist with collateral assignments to create\n                                       and implement intentional experiences that support the\n                                       department and university mission (assigned by supervisory\n                                       personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                        \n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Information Technology Intern is supervised by the Manager\n                                       of Information Technology. The Information Technology Intern\n                                       will assist with various tasks, ranging from web and software\n                                       development to support of vendor systems and hardware\n                                       workstation technologies. Job duties may include creating\n                                       documentation of existing software systems; modifying existing\n                                       solutions; helping to move, install, configure, remove, and\n                                       surplus hardware equipment; managing periodic announcements\n                                       about technology changes; writing or altering reports;\n                                       organizing data; and performing server maintenance and\n                                       support. The intern will attend departmental staff meetings\n                                       and may have the opportunity to attend other meetings as\n                                       available. Additionally, the intern may serve on departmental\n                                       committees, task forces, or assist with collateral assignments\n                                       to create and implement intentional experiences that support\n                                       the department and university mission (assigned by supervisory\n                                       personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                        \n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Marketing and Communications Intern is supervised by the\n                                       Manager of Marketing and Communications. The Marketing and\n                                       Communications will assist with various summer assignments,\n                                       including summer conferences, and New Student Orientation. Job\n                                       duties may include assisting the Manager of Marketing and\n                                       Communication for University Student Housing marketing\n                                       efforts; websites; press releases; newsletters; publications;\n                                       other communications; and special events. The Intern will also\n                                       oversee development and implementation of the University\n                                       Student Housing brand and department adherence to the Texas\n                                       Tech University branding guidelines. The University Student\n                                       Housing Marketing and Communications Intern will also assist\n                                       with strategic marketing and public relations campaigns. The\n                                       University Student Housing Marketing and Communications Intern\n                                       must have the ability to work with a diverse public: faculty,\n                                       staff, and campus/community partners. The intern will attend\n                                       departmental staff meetings and may have the opportunity to\n                                       attend other meetings as available. Additionally, the intern\n                                       may serve on departmental committees, task forces, or assist\n                                       with collateral assignments to create and implement\n                                       intentional experiences that support the department and\n                                       university mission (assigned by supervisory personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                        \n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Recruitment and Training Intern is supervised by the\n                                       Associate Director of Student Staff Recruitment and Training.\n                                       Projects may include assisting with the recruitment and\n                                       training of student and professional staff; assisting with the\n                                       development and communication of assessments; assisting with\n                                       development of academic year development series for student\n                                       and professional staff; and assisting with the development of\n                                       campus and community partnerships. This job will also assist\n                                       in researching best practices in training and recruitment. The\n                                       intern will attend departmental staff meetings and may have\n                                       the opportunity to attend other meetings as available.\n                                       Additionally, the intern may serve on departmental committees,\n                                       task forces, or assist with collateral assignments to create\n                                       and implement intentional experiences that support the\n                                       department and university mission (assigned by supervisory\n                                       personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                        \n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Student Leadership Intern is supervised by the Assistant\n                                       Director for Student Leadership Development. While direct\n                                       contact with student leaders will be somewhat limited, the\n                                       intern will work on significant projects that directly and\n                                       significantly benefit Texas Tech students. Projects may\n                                       include assisting in the development of Service Week, creation\n                                       of complex council election advertisements and materials,\n                                       assisting with the development of the annual Complex Council\n                                       retreat, assisting with the Howdy TECHsan early move-in\n                                       leadership program, fall traditional event preparation, social\n                                       justice benchmarking and compilation of area assessment data,\n                                       and updating and creating materials for Alternative Spring\n                                       Break leaders. The intern will attend departmental staff\n                                       meetings and may have the opportunity to attend other meetings\n                                       as available. Additionally, the intern may serve on\n                                       departmental committees, task forces, or assist with\n                                       collateral assignments to create and implement intentional\n                                       experiences that support the department and university mission\n                                       (assigned by supervisory personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                        \n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Summer School Intern is supervised by the Residence Life\n                                       Coordinator(s) for Summer School Operations. Projects may\n                                       include assisting with residence hall transition from Spring\n                                       to Summer, Summer Session I to Summer Session II, and Summer\n                                       Session II to Fall; assisting in training, supervision, and\n                                       evaluation of 6-17 summer Community Advisors; facilitating\n                                       weekly meetings with student staff; assisting with the\n                                       execution of the Residential Curriculum; serving in an on-call\n                                       rotation and assisting with oversight and scheduling of front\n                                       desk operations. The intern will attend departmental staff\n                                       meetings and may have the opportunity to attend other meetings\n                                       as available. Additionally, the intern may serve on\n                                       departmental committees, task forces, or assist with\n                                       collateral assignments to create and implement intentional\n                                       experiences that support the department and university mission\n                                       (assigned by supervisory personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                        \n                                       We recruit our interns through the\n                                       \n                                          ACUHO-I Internship Program.\n                                       \n                                       The Welcome Center Intern is supervised by the Manager of the\n                                       Welcome Center. The Welcome Center Intern will assist with\n                                       various summer assignments, including summer conferences, and\n                                       New Student Orientation. Job duties may include assisting with\n                                       check-ins and check-outs; assisting with presentations;\n                                       assisting with setting-up and hosting of information tables;\n                                       room assignments; creating signage; direct or indirect\n                                       supervision of student paraprofessionals; and assisting the\n                                       Manager – Welcome Center. The Welcome Center Intern may also\n                                       work with student/parent orientation, thereby having the\n                                       opportunity to meet and talk with partners and departments\n                                       from all areas of the university. The Welcome Center Intern is\n                                       a vital member of the residence hall community and the\n                                       University Student Housing Staff. The intern is expected to\n                                       work with the Associate Director for Client Relations,\n                                       Marketing, and Information Technology; Manager – Welcome\n                                       Center; Housing Advisors, Student Ambassadors; Student Housing\n                                       Coordinators; and visiting guests. The intern will attend\n                                       departmental staff meetings and may have the opportunity to\n                                       attend other meetings as available. Additionally, the intern\n                                       may serve on departmental committees, task forces, or assist\n                                       with collateral assignments to create and implement\n                                       intentional experiences that support the department and\n                                       university mission (assigned by supervisory personnel).\n                                       \n                                       Learn more about our ACUHO-I Internships\n                                       here.\n                                         ",
      "url": "https://www.depts.ttu.edu/housing/workforhousing.php"
    },
    {
      "title": "Current Open Positions | Strategic Research | Research Home  | TTU",
      "text": "Texas Tech will hire 35-40 additional faculty through a Strategic Investment Process\n                                             with the goal of maximizing the impact of research and creative endeavors of the university. The following positions are currently open. Check back periodically to view new positions,\n                                             or learn more about other faculty opportunities here.  Professor & Director of the Center for Vector-borne & Zoonotic Diseases  ",
      "url": "https://www.depts.ttu.edu/research/strategicresearch/hiring/"
    }
  ]
}